stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc.h
/**
  ******************************************************************************
  * @file    stm32u3xx_hal_rcc.h
  * @author  MCD Application Team
  * @brief   Header file of RCC HAL  module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32U3xx_HAL_RCC_H
#define __STM32U3xx_HAL_RCC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32u3xx_hal_def.h"
#include "stm32u3xx_ll_rcc.h"

/** @addtogroup STM32U3xx_HAL_Driver
  * @{
  */

/** @addtogroup RCC
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup RCC_Exported_Types RCC Exported Types
  * @{
  */

/**
  * @brief  RCC Internal/External Oscillator (HSE, HSI, MSIS, MSIK, LSE and LSI) configuration structure definition
  */
typedef struct
{
  uint32_t OscillatorType;        /*!< The oscillators to be configured.
                                       This parameter can be a value of @ref RCC_Oscillator_Type                    */

  uint32_t HSEState;              /*!< The new state of the HSE.
                                       This parameter can be a value of @ref RCC_HSE_Config                         */

  uint32_t HSIState;              /*!< The new state of the HSI.
                                       This parameter can be a value of @ref RCC_HSI_Config                         */

  uint32_t HSICalibrationValue;   /*!< The calibration trimming value (default is RCC_HSICALIBRATION_DEFAULT).
                                       This parameter must be a number between Min_Data = 0x00 and Max_Data = 0x7F  */

  uint32_t HSI48State;            /*!< The new state of the HSI48.
                                       This parameter can be a value of @ref RCC_HSI48_Config                       */

  uint32_t LSEState;              /*!< The new state of the LSE.
                                       This parameter can be a value of @ref RCC_LSE_Config                         */

  uint32_t LSIState;              /*!< The new state of the LSI.
                                       This parameter can be a value of @ref RCC_LSI_Config                         */

  uint32_t LSIDiv;                /*!< The division factor of the LSI. Applicable only to LSI.
                                       This parameter can be a value of @ref RCC_LSI_Div                            */

  uint32_t MSISState;             /*!< The new state of the MSIS.
                                       This parameter can be a value of @ref RCC_MSI_Config                         */

  uint32_t MSISSource;            /*!< The MSIRCx source to feed the MSIS.
                                       This parameter can be a value of @ref RCC_MSI_Source                         */

  uint32_t MSISDiv;               /*!< The division factor of the MSIS.
                                       This parameter can be a value of @ref RCC_MSI_Div                            */

  uint32_t MSIKState;             /*!< The new state of the MSIK.
                                       This parameter can be a value of @ref RCC_MSI_Config                         */

  uint32_t MSIKSource;            /*!< The MSIRCx source to feed the MSIK.
                                       This parameter can be a value of @ref RCC_MSI_Source                         */

  uint32_t MSIKDiv;               /*!< The division factor of the MSIK.
                                       This parameter can be a value of @ref RCC_MSI_Div                            */

} RCC_OscInitTypeDef;

/**
  * @brief  RCC System, AHB and APB busses clock configuration structure definition
  */
typedef struct
{
  uint32_t ClockType;               /*!< The clock to be configured.
                                         This parameter can be a value of @ref RCC_System_Clock_Type      */

  uint32_t SYSCLKSource;            /*!< The clock source used as system clock (SYSCLK).
                                         This parameter can be a value of @ref RCC_System_Clock_Source    */

  uint32_t AHBCLKDivider;           /*!< The AHB clock (HCLK) divider. This clock is derived from the system clock (SYSCLK).
                                         This parameter can be a value of @ref RCC_AHB_Clock_Source       */

  uint32_t APB1CLKDivider;          /*!< The APB1 clock (PCLK1) divider. This clock is derived from the AHB clock (HCLK).
                                         This parameter can be a value of @ref RCC_APB1_APB2_APB3_Clock_Source */

  uint32_t APB2CLKDivider;          /*!< The APB2 clock (PCLK2) divider. This clock is derived from the AHB clock (HCLK).
                                         This parameter can be a value of @ref RCC_APB1_APB2_APB3_Clock_Source */

  uint32_t APB3CLKDivider;          /*!< The APB3 clock (PCLK3) divider. This clock is derived from the AHB clock (HCLK).
                                         This parameter can be a value of @ref RCC_APB1_APB2_APB3_Clock_Source */

} RCC_ClkInitTypeDef;
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCC_Exported_Constants RCC Exported Constants
  * @{
  */

/** @defgroup RCC_Timeout_Value Timeout Values
  * @{
  */
#define RCC_LSE_TIMEOUT_VALUE           LSE_STARTUP_TIMEOUT
/**
  * @}
  */

/** @defgroup RCC_Oscillator_Type Oscillator Type
  * @{
  */
#define RCC_OSCILLATORTYPE_NONE         0x00000000U   /*!< Oscillator configuration unchanged */
#define RCC_OSCILLATORTYPE_HSE          0x00000001U   /*!< HSE to configure */
#define RCC_OSCILLATORTYPE_HSI          0x00000002U   /*!< HSI to configure */
#define RCC_OSCILLATORTYPE_LSE          0x00000004U   /*!< LSE to configure */
#define RCC_OSCILLATORTYPE_LSI          0x00000008U   /*!< LSI to configure */
#define RCC_OSCILLATORTYPE_HSI48        0x00000010U   /*!< HSI48 to configure */
#define RCC_OSCILLATORTYPE_MSIS         0x00000020U   /*!< MSIS to configure */
#define RCC_OSCILLATORTYPE_MSIK         0x00000040U   /*!< MSIK to configure */
/**
  * @}
  */

/** @defgroup RCC_HSE_Config HSE Config
  * @{
  */
#define RCC_HSE_OFF                     0x00000000U                                   /*!< HSE clock deactivation */
#define RCC_HSE_ON                      RCC_CR_HSEON                                  /*!< HSE clock activation */
#define RCC_HSE_BYPASS                 (RCC_CR_HSEBYP | RCC_CR_HSEON)                 /*!< External clock source for HSE clock */
#define RCC_HSE_BYPASS_DIGITAL         (RCC_CR_HSEEXT | RCC_CR_HSEBYP | RCC_CR_HSEON) /*!< Digital external clock source for HSE clock */
/**
  * @}
  */

/** @defgroup RCC_HSI_Config HSI Config
  * @{
  */
#define RCC_HSI_OFF                     0x00000000U         /*!< HSI clock deactivation */
#define RCC_HSI_ON                      RCC_CR_HSION        /*!< HSI clock activation */

#define RCC_HSICALIBRATION_DEFAULT      0x10U               /* Default HSI calibration trimming value */
/**
  * @}
  */

/** @defgroup RCC_HSI48_Config HSI48 Config
  * @{
  */
#define RCC_HSI48_OFF                   0x00000000U         /*!< HSI48 clock deactivation */
#define RCC_HSI48_ON                    RCC_CR_HSI48ON      /*!< HSI48 clock activation */
/**
  * @}
  */


/** @defgroup RCC_LSE_Config LSE Config
  * @{
  */
#define RCC_LSE_OFF                     0U                                                     /*!< LSE clock deactivation */
#define RCC_LSE_ON_RTC_ONLY             RCC_BDCR_LSEON                                         /*!< LSE clock activation for RTC only */
#define RCC_LSE_ON                      (RCC_BDCR_LSESYSEN | RCC_BDCR_LSEON)                   /*!< LSE clock activation for RCC and peripherals */
#define RCC_LSE_BYPASS_RTC_ONLY         (RCC_BDCR_LSEBYP | RCC_BDCR_LSEON)                     /*!< External clock source for LSE clock */
#define RCC_LSE_BYPASS                  (RCC_BDCR_LSEBYP | RCC_BDCR_LSESYSEN | RCC_BDCR_LSEON) /*!< External clock source for LSE clock */
/**
  * @}
  */

/** @defgroup RCC_LSI_Config LSI Config
  * @{
  */
#define RCC_LSI_OFF                    0x00000000U          /*!< LSI clock deactivation */
#define RCC_LSI_ON                     RCC_CSR_LSION        /*!< LSI clock activation */
/**
  * @}
  */

/** @defgroup RCC_LSI_Div LSI Div
  * @{
  */
#define RCC_LSI_DIV1                    0U                  /*!< LSI clock is not divided */
#define RCC_LSI_DIV128                  RCC_CSR_LSIPREDIV   /*!< LSI clock is divided by 128 */
/**
  * @}
  */

/** @defgroup RCC_MSI_Config MSI Config
  * @{
  */
#define RCC_MSI_OFF                     0x00000000U         /*!< MSI clock deactivation */
#define RCC_MSI_ON                      RCC_CR_MSISON       /*!< MSI clock activation */
/**
  * @}
  */

/** @defgroup RCC_MSI_Source MSI Source
  * @{
  */
#define RCC_MSI_RC0                     0x00000000U         /*!< MSIRC0 (96 MHz) selected as MSI source */
#define RCC_MSI_RC1                     RCC_ICSCR1_MSISSEL  /*!< MSIRC1 (24 MHz) selected as MSI source */
/**
  * @}
  */

/** @defgroup RCC_MSI_Div MSI Divider
  * @note   If MSI source is MSIRC0
  *         range 0 (96 MHz) is selected using RCC_MSI_DIV1
  *         range 1 (48 MHz) is selected using RCC_MSI_DIV2
  *         range 2 (24 MHz) is selected using RCC_MSI_DIV4
  *         range 3 (12 MHz) is selected using RCC_MSI_DIV8
  * @note   If MSI source is MSIRC1
  *         range 4 (24 MHz) is selected using RCC_MSI_DIV1
  *         range 5 (12 MHz) is selected using RCC_MSI_DIV2
  *         range 6 ( 6 MHz) is selected using RCC_MSI_DIV4
  *         range 7 ( 3 MHz) is selected using RCC_MSI_DIV8
  * @{
  */
#define RCC_MSI_DIV1                    0x00000000U                                    /*!< MSIRCx divided by 1 */
#define RCC_MSI_DIV2                    RCC_ICSCR1_MSISDIV_0                           /*!< MSIRCx divided by 2 */
#define RCC_MSI_DIV4                    RCC_ICSCR1_MSISDIV_1                           /*!< MSIRCx divided by 4 */
#define RCC_MSI_DIV8                    (RCC_ICSCR1_MSISDIV_1 | RCC_ICSCR1_MSISDIV_0)  /*!< MSIRCx divided by 8 */
/**
  * @}
  */

/** @defgroup RCC_System_Clock_Type System Clock Type
  * @{
  */
#define RCC_CLOCKTYPE_SYSCLK            0x00000001U  /*!< SYSCLK to configure */
#define RCC_CLOCKTYPE_HCLK              0x00000002U  /*!< HCLK to configure   */
#define RCC_CLOCKTYPE_PCLK1             0x00000004U  /*!< PCLK1 to configure  */
#define RCC_CLOCKTYPE_PCLK2             0x00000008U  /*!< PCLK2 to configure  */
#define RCC_CLOCKTYPE_PCLK3             0x00000010U  /*!< PCLK3 to configure  */
/**
  * @}
  */

