stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc.h
/** @defgroup RCC_System_Clock_Source System Clock Source
  * @{
  */
#define RCC_SYSCLKSOURCE_MSIS           0x00000000U                        /*!< MSIS selection as system clock */
#define RCC_SYSCLKSOURCE_HSI            RCC_CFGR1_SW_0                     /*!< HSI16 selection as system clock */
#define RCC_SYSCLKSOURCE_HSE            RCC_CFGR1_SW_1                     /*!< HSE selection as system clock */
/**
  * @}
  */

/** @defgroup RCC_System_Clock_Source_Status System Clock Source Status
  * @{
  */
#define RCC_SYSCLKSOURCE_STATUS_MSIS    0x00000000U                         /*!< HSI16 used as system clock */
#define RCC_SYSCLKSOURCE_STATUS_HSI     RCC_CFGR1_SWS_0                     /*!< HSI16 used as system clock */
#define RCC_SYSCLKSOURCE_STATUS_HSE     RCC_CFGR1_SWS_1                     /*!< HSE used as system clock */
/**
  * @}
  */

/** @defgroup RCC_AHB_Clock_Source AHB Clock Source
  * @{
  */
#define RCC_SYSCLK_DIV1                 0x00000000U                                                                 /*!< SYSCLK not divided */
#define RCC_SYSCLK_DIV2                 RCC_CFGR2_HPRE_3                                                            /*!< SYSCLK divided by 2 */
#define RCC_SYSCLK_DIV4                 (RCC_CFGR2_HPRE_3 | RCC_CFGR2_HPRE_0)                                       /*!< SYSCLK divided by 4 */
#define RCC_SYSCLK_DIV8                 (RCC_CFGR2_HPRE_3 | RCC_CFGR2_HPRE_1)                                       /*!< SYSCLK divided by 8 */
#define RCC_SYSCLK_DIV16                (RCC_CFGR2_HPRE_3 | RCC_CFGR2_HPRE_1 | RCC_CFGR2_HPRE_0)                    /*!< SYSCLK divided by 16 */
#define RCC_SYSCLK_DIV64                (RCC_CFGR2_HPRE_3 | RCC_CFGR2_HPRE_2)                                       /*!< SYSCLK divided by 64 */
#define RCC_SYSCLK_DIV128               (RCC_CFGR2_HPRE_3 | RCC_CFGR2_HPRE_2 | RCC_CFGR2_HPRE_0)                    /*!< SYSCLK divided by 128 */
#define RCC_SYSCLK_DIV256               (RCC_CFGR2_HPRE_3 | RCC_CFGR2_HPRE_2 | RCC_CFGR2_HPRE_1)                    /*!< SYSCLK divided by 256 */
#define RCC_SYSCLK_DIV512               (RCC_CFGR2_HPRE_3 | RCC_CFGR2_HPRE_2 | RCC_CFGR2_HPRE_1 | RCC_CFGR2_HPRE_0) /*!< SYSCLK divided by 512 */
/**
  * @}
  */

/** @defgroup RCC_APB1_APB2_APB3_Clock_Source APB1 APB2 APB3 Clock Source
  * @{
  */
#define RCC_HCLK_DIV1                   (0x00000000U)                                               /*!< HCLK not divided */
#define RCC_HCLK_DIV2                   RCC_CFGR2_PPRE1_2                                           /*!< HCLK divided by 2 */
#define RCC_HCLK_DIV4                   (RCC_CFGR2_PPRE1_2 | RCC_CFGR2_PPRE1_0)                     /*!< HCLK divided by 4 */
#define RCC_HCLK_DIV8                   (RCC_CFGR2_PPRE1_2 | RCC_CFGR2_PPRE1_1)                     /*!< HCLK divided by 8 */
#define RCC_HCLK_DIV16                  (RCC_CFGR2_PPRE1_2 | RCC_CFGR2_PPRE1_1 | RCC_CFGR2_PPRE1_0) /*!< HCLK divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_RTC_Clock_Source RTC Clock Source
  * @{
  */
#define RCC_RTCCLKSOURCE_DISABLE        0x00000000U        /*!< RTC clock is disabled */
#define RCC_RTCCLKSOURCE_LSE            RCC_BDCR_RTCSEL_0  /*!< LSE oscillator clock used as RTC clock */
#define RCC_RTCCLKSOURCE_LSI            RCC_BDCR_RTCSEL_1  /*!< LSI or LIS2 oscillator clock used as RTC clock */
#define RCC_RTCCLKSOURCE_HSE_DIV32      RCC_BDCR_RTCSEL    /*!< HSE oscillator clock divided by 32 used as RTC clock */
/**
  * @}
  */

/* @cond */
/*  32     28      20       16      0
    ---------------------------------
    | MCO   | GPIO  | GPIO  | GPIO  |
    | Index |  AF   | Port  |  Pin  |
    --------------------------------- */
#define RCC_MCO_GPIOPIN_POS             0U
#define RCC_MCO_GPIOPIN_MASK            (0xFFFFuL << RCC_MCO_GPIOPIN_POS)
#define RCC_MCO_GPIOPORT_POS            16U
#define RCC_MCO_GPIOPORT_MASK           (0xFuL << RCC_MCO_GPIOPORT_POS)
#define RCC_MCO_GPIOAF_POS              20U
#define RCC_MCO_GPIOAF_MASK             (0xFuL << RCC_MCO_GPIOAF_POS)
#define RCC_MCO_INDEX_POS               28U
#define RCC_MCO_INDEX_MASK              (0x1uL << RCC_MCO_INDEX_POS)
/* @endcond */

/** @defgroup RCC_MCO_Index MCO Index
  * @{
  */
#define RCC_MCO1_PA8                    ((0x00U << RCC_MCO_INDEX_POS) |\
                                         (GPIO_AF0_MCO << RCC_MCO_GPIOAF_POS) | GPIO_PIN_8)
#define RCC_MCO1_PA9                    ((0x00U << RCC_MCO_INDEX_POS) |\
                                         (GPIO_AF0_MCO << RCC_MCO_GPIOAF_POS) | GPIO_PIN_9)
#define RCC_MCO1                        RCC_MCO1_PA8
#define RCC_MCO2_PA8                    ((0x01U << RCC_MCO_INDEX_POS) |\
                                         (GPIO_AF11_MCO2 << RCC_MCO_GPIOAF_POS) | GPIO_PIN_8)
#define RCC_MCO2_PA10                   ((0x01U << RCC_MCO_INDEX_POS) |\
                                         (GPIO_AF11_MCO2 << RCC_MCO_GPIOAF_POS) | GPIO_PIN_10)
#define RCC_MCO2                        RCC_MCO2_PA8
#define RCC_MCO                         RCC_MCO1
/**
  * @}
  */

/** @defgroup RCC_MCO1_Clock_Source MCO1 Clock Source
  * @{
  */
#define RCC_MCO1SOURCE_NOCLOCK          0x00000000U                                                       /*!< MCO1 output disabled, no clock on MCO1 */
#define RCC_MCO1SOURCE_SYSCLK           RCC_CFGR1_MCOSEL_0                                                /*!< SYSCLK selection as MCO1 source */
#define RCC_MCO1SOURCE_MSIS             RCC_CFGR1_MCOSEL_1                                                /*!< MSIS selection as MCO1 source */
#define RCC_MCO1SOURCE_HSI              (RCC_CFGR1_MCOSEL_1 | RCC_CFGR1_MCOSEL_0)                         /*!< HSI16 selection as MCO1 source */
#define RCC_MCO1SOURCE_HSE              RCC_CFGR1_MCOSEL_2                                                /*!< HSE selection as MCO1 source */
#define RCC_MCO1SOURCE_LSI              (RCC_CFGR1_MCOSEL_2 | RCC_CFGR1_MCOSEL_0)                         /*!< LSI selection as MCO1 source */
#define RCC_MCO1SOURCE_LSE              (RCC_CFGR1_MCOSEL_2 | RCC_CFGR1_MCOSEL_1)                         /*!< LSE selection as MCO1 source */
#define RCC_MCO1SOURCE_HSI48            (RCC_CFGR1_MCOSEL_2 | RCC_CFGR1_MCOSEL_1 | RCC_CFGR1_MCOSEL_0)    /*!< HSI48 selection as MCO1 source */
#define RCC_MCO1SOURCE_MSIK             RCC_CFGR1_MCOSEL_3                                                /*!< MSIK selection as MCO1 source */
/**
  * @}
  */

/** @defgroup RCC_MCOx_Clock_Prescaler MCO1 Clock Prescaler
  * @{
  */
#define RCC_MCODIV_1                    0x00000000U                                                       /*!< MCO is divided by 1 */
#define RCC_MCODIV_2                    RCC_CFGR1_MCOPRE_0                                                /*!< MCO is divided by 2 */
#define RCC_MCODIV_4                    RCC_CFGR1_MCOPRE_1                                                /*!< MCO is divided by 4 */
#define RCC_MCODIV_8                    (RCC_CFGR1_MCOPRE_1 | RCC_CFGR1_MCOPRE_0)                         /*!< MCO is divided by 8 */
#define RCC_MCODIV_16                   RCC_CFGR1_MCOPRE_2                                                /*!< MCO is divided by 16 */
#define RCC_MCODIV_32                   (RCC_CFGR1_MCOPRE_2 | RCC_CFGR1_MCOPRE_0)                         /*!< MCO is divided by 32 */
#define RCC_MCODIV_64                   (RCC_CFGR1_MCOPRE_2 | RCC_CFGR1_MCOPRE_1)                         /*!< MCO is divided by 64 */
#define RCC_MCODIV_128                  (RCC_CFGR1_MCOPRE_2 | RCC_CFGR1_MCOPRE_1 | RCC_CFGR1_MCOPRE_0)    /*!< MCO is divided by 128 */
/**
  * @}
  */

