stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc.h
/** @defgroup RCC_MCO2_Clock_Source MCO2 Clock Source
  * @{
  */
#define RCC_MCO2SOURCE_NOCLOCK          0x00000000U                                                       /*!< MCO2 output disabled, no clock on MCO2 */
#define RCC_MCO2SOURCE_SYSCLK           RCC_CFGR1_MCO2SEL_0                                               /*!< SYSCLK selection as MCO2 source */
#define RCC_MCO2SOURCE_MSIS             RCC_CFGR1_MCO2SEL_1                                               /*!< MSIS selection as MCO2 source */
#define RCC_MCO2SOURCE_HSI              (RCC_CFGR1_MCO2SEL_1 | RCC_CFGR1_MCO2SEL_0)                       /*!< HSI16 selection as MCO2 source */
#define RCC_MCO2SOURCE_HSE              RCC_CFGR1_MCO2SEL_2                                               /*!< HSE selection as MCO2 source */
#define RCC_MCO2SOURCE_LSI              (RCC_CFGR1_MCO2SEL_2 | RCC_CFGR1_MCO2SEL_0)                       /*!< LSI selection as MCO2 source */
#define RCC_MCO2SOURCE_LSE              (RCC_CFGR1_MCO2SEL_2 | RCC_CFGR1_MCO2SEL_1)                       /*!< LSE selection as MCO2 source */
#define RCC_MCO2SOURCE_HSI48            (RCC_CFGR1_MCO2SEL_2 | RCC_CFGR1_MCO2SEL_1 | RCC_CFGR1_MCO2SEL_0) /*!< HSI48 selection as MCO2 source */
#define RCC_MCO2SOURCE_MSIK             RCC_CFGR1_MCO2SEL_3                                               /*!< MSIK selection as MCO2 source */
/**
  * @}
  */

/** @defgroup RCC_MCO2_Clock_Prescaler MCO2 Clock Prescaler
  * @{
  */
#define RCC_MCO2DIV_1                   0x00000000U                                                       /*!< MCO2 is divided by 1 */
#define RCC_MCO2DIV_2                   RCC_CFGR1_MCO2PRE_0                                               /*!< MCO2 is divided by 2 */
#define RCC_MCO2DIV_4                   RCC_CFGR1_MCO2PRE_1                                               /*!< MCO2 is divided by 4 */
#define RCC_MCO2DIV_8                   (RCC_CFGR1_MCO2PRE_1 | RCC_CFGR1_MCO2PRE_0)                       /*!< MCO2 is divided by 8 */
#define RCC_MCO2DIV_16                  RCC_CFGR1_MCO2PRE_2                                               /*!< MCO2 is divided by 16 */
#define RCC_MCO2DIV_32                  (RCC_CFGR1_MCO2PRE_2 | RCC_CFGR1_MCO2PRE_0)                       /*!< MCO2 is divided by 32 */
#define RCC_MCO2DIV_64                  (RCC_CFGR1_MCO2PRE_2 | RCC_CFGR1_MCO2PRE_1)                       /*!< MCO2 is divided by 64 */
#define RCC_MCO2DIV_128                 (RCC_CFGR1_MCO2PRE_2 | RCC_CFGR1_MCO2PRE_1 | RCC_CFGR1_MCO2PRE_0) /*!< MCO2 is divided by 128 */
/**
  * @}
  */

/** @defgroup RCC_Interrupt Interrupts
  * @{
  */
#define RCC_IT_HSIRDY                   RCC_CIFR_HSIRDYF      /*!< HSI16 Ready Interrupt flag */
#define RCC_IT_HSI48RDY                 RCC_CIFR_HSI48RDYF    /*!< HSI48 Ready Interrupt flag */
#define RCC_IT_HSERDY                   RCC_CIFR_HSERDYF      /*!< HSE Ready Interrupt flag */
#define RCC_IT_LSIRDY                   RCC_CIFR_LSIRDYF      /*!< LSI Ready Interrupt flag */
#define RCC_IT_LSERDY                   RCC_CIFR_LSERDYF      /*!< LSE Ready Interrupt flag */
#define RCC_IT_MSISRDY                  RCC_CIFR_MSISRDYF     /*!< MSIS Ready Interrupt flag */
#define RCC_IT_MSIKRDY                  RCC_CIFR_MSIKRDYF     /*!< MSIK Ready Interrupt flag */
#define RCC_IT_MSI_PLL0RDY              RCC_CIFR_MSIPLL0RDYF  /*!< MSI RC0 PLL Ready Interrupt flag */
#define RCC_IT_MSI_PLL1RDY              RCC_CIFR_MSIPLL1RDYF  /*!< MSI RC1 PLL Ready Interrupt flag */
#define RCC_IT_MSI_PLLUNLCK_HSE         RCC_CIFR_MSIPLLHSUF   /*!< MSI PLL-mode with HSE unlock Interrupt Flag*/
#define RCC_IT_MSI_PLLUNLCK_LSE         RCC_CIFR_MSIPLLUF     /*!< MSI PLL-mode with LSE unlock Interrupt Flag*/
#define RCC_IT_CSS                      RCC_CIFR_CSSF         /*!< Clock Security System Interrupt flag */
#define RCC_IT_LSECSS                   RCC_CIFR_LSECSSF      /*!< LSE Clock Security System Interrupt flag */
/**
  * @}
  */

/** @defgroup RCC_Flag Flags
  *        Elements values convention: XXXYYYYYb
  *           - YYYYY  : Flag position in the register
  *           - XXX  : Register index
  *                 - 001: CR register
  *                 - 010: BDCR register
  *                 - 011: CSR register
  * @{
  */
/* Flags in the CR register */
#define RCC_FLAG_HSIRDY                 ((CR_REG_INDEX << 5U) | RCC_CR_HSIRDY_Pos)        /*!< HSI Ready flag */
#define RCC_FLAG_HSI48RDY               ((CR_REG_INDEX << 5U) | RCC_CR_HSI48RDY_Pos)      /*!< HSI48 Ready flag */
#define RCC_FLAG_HSERDY                 ((CR_REG_INDEX << 5U) | RCC_CR_HSERDY_Pos)        /*!< HSE Ready flag */
#define RCC_FLAG_MSISRDY                ((CR_REG_INDEX << 5U) | RCC_CR_MSISRDY_Pos)       /*!< MSIS Ready flag */
#define RCC_FLAG_MSIKRDY                ((CR_REG_INDEX << 5U) | RCC_CR_MSIKRDY_Pos)       /*!< MSIK Ready flag */
#define RCC_FLAG_MSI_PLL0RDY            ((CR_REG_INDEX << 5U) | RCC_CR_MSIPLL0RDY_Pos)    /*!< MSI RC0 PLL Ready Interrupt flag */
#define RCC_FLAG_MSI_PLL1RDY            ((CR_REG_INDEX << 5U) | RCC_CR_MSIPLL1RDY_Pos)    /*!< MSI RC1 PLL Ready Interrupt flag */

/* Flags in the BDCR register */
#define RCC_FLAG_LSERDY                 ((BDCR_REG_INDEX << 5U) | RCC_BDCR_LSERDY_Pos)    /*!< LSE Ready flag */
#define RCC_FLAG_LSESYSRDY              ((BDCR_REG_INDEX << 5U) | RCC_BDCR_LSESYSRDY_Pos) /*!< LSESYS Ready flag */
#define RCC_FLAG_LSECSSD                ((BDCR_REG_INDEX << 5U) | RCC_BDCR_LSECSSD_Pos)   /*!< LSE Clock Security System Interrupt flag */

/* Flags in the CSR register */
#define RCC_FLAG_OBLRST                 ((CSR_REG_INDEX << 5U) | RCC_CSR_OBLRSTF_Pos)      /*!< Option Byte Loader reset flag */
#define RCC_FLAG_PINRST                 ((CSR_REG_INDEX << 5U) | RCC_CSR_PINRSTF_Pos)      /*!< PIN reset flag */
#define RCC_FLAG_BORRST                 ((CSR_REG_INDEX << 5U) | RCC_CSR_BORRSTF_Pos)      /*!< BOR reset flag */
#define RCC_FLAG_SFTRST                 ((CSR_REG_INDEX << 5U) | RCC_CSR_SFTRSTF_Pos)      /*!< Software Reset flag */
#define RCC_FLAG_IWDGRST                ((CSR_REG_INDEX << 5U) | RCC_CSR_IWDGRSTF_Pos)     /*!< Independent Watchdog reset flag */
#define RCC_FLAG_WWDGRST                ((CSR_REG_INDEX << 5U) | RCC_CSR_WWDGRSTF_Pos)     /*!< Window watchdog reset flag */
#define RCC_FLAG_LPWRRST                ((CSR_REG_INDEX << 5U) | RCC_CSR_LPWRRSTF_Pos)     /*!< Low-Power reset flag */
#define RCC_FLAG_LSIRDY                 ((CSR_REG_INDEX << 5U) | RCC_CSR_LSIRDY_Pos)       /*!< LSI Ready flag */
/**
  * @}
  */

/** @defgroup RCC_LSEDrive_Config LSE Drive Config
  * @{
  */
#define RCC_LSEDRIVE_LOW                0x00000000U            /*!< LSE low drive capability */
#define RCC_LSEDRIVE_MEDIUMLOW          RCC_BDCR_LSEDRV_0      /*!< LSE medium low drive capability */
#define RCC_LSEDRIVE_MEDIUMHIGH         RCC_BDCR_LSEDRV_1      /*!< LSE medium high drive capability */
#define RCC_LSEDRIVE_HIGH               RCC_BDCR_LSEDRV        /*!< LSE high drive capability */
/**
  * @}
  */

/** @defgroup RCC_Reset_Flag Reset Flag
  * @{
  */
#define RCC_RESET_FLAG_OBL              RCC_CSR_OBLRSTF    /*!< Option Byte Loader reset flag */
#define RCC_RESET_FLAG_PIN              RCC_CSR_PINRSTF    /*!< PIN reset flag */
#define RCC_RESET_FLAG_PWR              RCC_CSR_BORRSTF    /*!< BOR or POR/PDR reset flag */
#define RCC_RESET_FLAG_SW               RCC_CSR_SFTRSTF    /*!< Software Reset flag */
#define RCC_RESET_FLAG_IWDG             RCC_CSR_IWDGRSTF   /*!< Independent Watchdog reset flag */
#define RCC_RESET_FLAG_WWDG             RCC_CSR_WWDGRSTF   /*!< Window watchdog reset flag */
#define RCC_RESET_FLAG_LPWR             RCC_CSR_LPWRRSTF   /*!< Low power reset flag */
#define RCC_RESET_FLAG_ALL              (RCC_RESET_FLAG_OBL | RCC_RESET_FLAG_PIN  | RCC_RESET_FLAG_PWR  | \
                                         RCC_RESET_FLAG_SW  | RCC_RESET_FLAG_IWDG | RCC_RESET_FLAG_WWDG | \
                                         RCC_RESET_FLAG_LPWR)
/**
  * @}
  */

