stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc.h
#define __HAL_RCC_RNG_CLK_ENABLE()                do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_RNGEN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_RNGEN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_PKA_CLK_ENABLE()                do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_PKAEN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_PKAEN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_SAES_CLK_ENABLE()               do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_SAESEN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_SAESEN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_CCB_CLK_ENABLE()                do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_CCBEN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_CCBEN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_SDMMC1_CLK_ENABLE()             do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_SDMMC1EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_SDMMC1EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_SRAM2_CLK_ENABLE()              do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_SRAM2EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_SRAM2EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#if defined(SRAM3)
#define __HAL_RCC_SRAM3_CLK_ENABLE()              do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_SRAM3EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_SRAM3EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)
#endif /* SRAM3 */

#define __HAL_RCC_OCTOSPI1_CLK_ENABLE()           do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->AHB2ENR2, RCC_AHB2ENR2_OCTOSPI1EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->AHB2ENR2, RCC_AHB2ENR2_OCTOSPI1EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_GPIOA_CLK_DISABLE()             CLEAR_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_GPIOAEN)
#define __HAL_RCC_GPIOB_CLK_DISABLE()             CLEAR_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_GPIOBEN)
#define __HAL_RCC_GPIOC_CLK_DISABLE()             CLEAR_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_GPIOCEN)
#define __HAL_RCC_GPIOD_CLK_DISABLE()             CLEAR_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_GPIODEN)
#define __HAL_RCC_GPIOE_CLK_DISABLE()             CLEAR_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_GPIOEEN)
#if defined(GPIOF)
#define __HAL_RCC_GPIOF_CLK_DISABLE()             CLEAR_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_GPIOFEN)
#endif /* GPIOF */
#define __HAL_RCC_GPIOG_CLK_DISABLE()             CLEAR_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_GPIOGEN)
#define __HAL_RCC_GPIOH_CLK_DISABLE()             CLEAR_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_GPIOHEN)
#define __HAL_RCC_ADC12_CLK_DISABLE()             CLEAR_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_ADC12EN)
#define __HAL_RCC_DAC1_CLK_DISABLE()              CLEAR_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_DAC1EN)
#define __HAL_RCC_AES_CLK_DISABLE()               CLEAR_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_AESEN)
#define __HAL_RCC_HASH_CLK_DISABLE()              CLEAR_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_HASHEN)
#define __HAL_RCC_RNG_CLK_DISABLE()               CLEAR_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_RNGEN)
#define __HAL_RCC_PKA_CLK_DISABLE()               CLEAR_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_PKAEN)
#define __HAL_RCC_SAES_CLK_DISABLE()              CLEAR_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_SAESEN)
#define __HAL_RCC_CCB_CLK_DISABLE()               CLEAR_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_CCBEN)
#define __HAL_RCC_SDMMC1_CLK_DISABLE()            CLEAR_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_SDMMC1EN)
#define __HAL_RCC_SRAM2_CLK_DISABLE()             CLEAR_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_SRAM2EN)
#if defined(SRAM3)
#define __HAL_RCC_SRAM3_CLK_DISABLE()             CLEAR_BIT(RCC->AHB2ENR1, RCC_AHB2ENR1_SRAM3EN)
#endif /* SRAM3 */
#define __HAL_RCC_OCTOSPI1_CLK_DISABLE()          CLEAR_BIT(RCC->AHB2ENR2, RCC_AHB2ENR2_OCTOSPI1EN)
/**
  * @}
  */

/** @defgroup RCC_APB1_Clock_Enable_Disable APB1 Peripheral Clock Enable Disable
  * @brief  Enable or disable the APB1 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __HAL_RCC_TIM2_CLK_ENABLE()               do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM2EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM2EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_TIM3_CLK_ENABLE()               do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM3EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM3EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

