stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc.h
#define __HAL_RCC_TIM4_CLK_ENABLE()               do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM4EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM4EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_TIM6_CLK_ENABLE()               do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM6EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM6EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_TIM7_CLK_ENABLE()               do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM7EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM7EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_SPI3_CLK_ENABLE()               do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPI3EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPI3EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#if defined(SPI4)
#define __HAL_RCC_SPI4_CLK_ENABLE()               do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPI4EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPI4EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)
#endif /* SPI4 */


#define __HAL_RCC_WWDG_CLK_ENABLE()               do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_WWDGEN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_WWDGEN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_SPI2_CLK_ENABLE()               do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPI2EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPI2EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#if defined(USART2)
#define __HAL_RCC_USART2_CLK_ENABLE()             do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USART2EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USART2EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)
#endif /* USART2 */

#define __HAL_RCC_USART3_CLK_ENABLE()             do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USART3EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USART3EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_UART4_CLK_ENABLE()              do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART4EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART4EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_UART5_CLK_ENABLE()              do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART5EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART5EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_I2C1_CLK_ENABLE()               do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C1EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C1EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_I2C2_CLK_ENABLE()               do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C2EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C2EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_I3C1_CLK_ENABLE()               do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I3C1EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I3C1EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

