stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc.h
#define __HAL_RCC_CRS_CLK_ENABLE()                do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_CRSEN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_CRSEN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_OPAMP_CLK_ENABLE()              do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_OPAMPEN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_OPAMPEN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_VREF_CLK_ENABLE()               do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_VREFEN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_VREFEN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_RTCAPB_CLK_ENABLE()             do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR1, RCC_APB1ENR1_RTCAPBEN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR1, RCC_APB1ENR1_RTCAPBEN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#if defined(I2C4)
#define __HAL_RCC_I2C4_CLK_ENABLE()               do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR2, RCC_APB1ENR2_I2C4EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR2, RCC_APB1ENR2_I2C4EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)
#endif /* I2C4 */

#define __HAL_RCC_LPTIM2_CLK_ENABLE()             do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR2, RCC_APB1ENR2_LPTIM2EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR2, RCC_APB1ENR2_LPTIM2EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_FDCAN_CLK_ENABLE()             do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB1ENR2, RCC_APB1ENR2_FDCANEN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB1ENR2, RCC_APB1ENR2_FDCANEN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_TIM2_CLK_DISABLE()              CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM2EN)
#define __HAL_RCC_TIM3_CLK_DISABLE()              CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM3EN)
#define __HAL_RCC_TIM4_CLK_DISABLE()              CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM4EN)
#define __HAL_RCC_TIM6_CLK_DISABLE()              CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM6EN)
#define __HAL_RCC_TIM7_CLK_DISABLE()              CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_TIM7EN)
#define __HAL_RCC_SPI3_CLK_DISABLE()              CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPI3EN)
#if defined(SPI4)
#define __HAL_RCC_SPI4_CLK_DISABLE()              CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPI4EN)
#endif /* SPI4 */
#define __HAL_RCC_SPI2_CLK_DISABLE()              CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_SPI2EN)
#if defined(USART2)
#define __HAL_RCC_USART2_CLK_DISABLE()            CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USART2EN)
#endif /* USART2 */
#define __HAL_RCC_USART3_CLK_DISABLE()            CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_USART3EN)
#define __HAL_RCC_UART4_CLK_DISABLE()             CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART4EN)
#define __HAL_RCC_UART5_CLK_DISABLE()             CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_UART5EN)
#define __HAL_RCC_I2C1_CLK_DISABLE()              CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C1EN)
#define __HAL_RCC_I2C2_CLK_DISABLE()              CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I2C2EN)
#define __HAL_RCC_I3C1_CLK_DISABLE()              CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_I3C1EN)
#define __HAL_RCC_CRS_CLK_DISABLE()               CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_CRSEN)
#define __HAL_RCC_OPAMP_CLK_DISABLE()             CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_OPAMPEN)
#define __HAL_RCC_VREF_CLK_DISABLE()              CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_VREFEN)
#define __HAL_RCC_RTCAPB_CLK_DISABLE()            CLEAR_BIT(RCC->APB1ENR1, RCC_APB1ENR1_RTCAPBEN)
#if defined(I2C4)
#define __HAL_RCC_I2C4_CLK_DISABLE()              CLEAR_BIT(RCC->APB1ENR2, RCC_APB1ENR2_I2C4EN)
#endif /* I2C4 */
#define __HAL_RCC_LPTIM2_CLK_DISABLE()            CLEAR_BIT(RCC->APB1ENR2, RCC_APB1ENR2_LPTIM2EN)
#define __HAL_RCC_FDCAN_CLK_DISABLE()             CLEAR_BIT(RCC->APB1ENR2, RCC_APB1ENR2_FDCANEN)
/**
  * @}
  */

/** @defgroup RCC_APB2_Clock_Enable_Disable APB2 Peripheral Clock Enable Disable
  * @brief  Enable or disable the APB2 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __HAL_RCC_TIM1_CLK_ENABLE()               do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM1EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM1EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_SPI1_CLK_ENABLE()               do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SPI1EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SPI1EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#if defined(TIM8)
#define __HAL_RCC_TIM8_CLK_ENABLE()              do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM8EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM8EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)
#endif /* TIM8 */

#define __HAL_RCC_USART1_CLK_ENABLE()             do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB2ENR, RCC_APB2ENR_USART1EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_USART1EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#if defined(TIM12)
#define __HAL_RCC_TIM12_CLK_ENABLE()              do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM12EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM12EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)
#endif /* TIM12 */

#define __HAL_RCC_TIM15_CLK_ENABLE()              do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM15EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM15EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_TIM16_CLK_ENABLE()              do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM16EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM16EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_TIM17_CLK_ENABLE()              do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM17EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM17EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_SAI1_CLK_ENABLE()               do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SAI1EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SAI1EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_USB1_CLK_ENABLE()               do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB2ENR, RCC_APB2ENR_USB1EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_USB1EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

