stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc.h
#define __HAL_RCC_I3C2_CLK_ENABLE()               do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB2ENR, RCC_APB2ENR_I3C2EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_I3C2EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_TIM1_CLK_DISABLE()              CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM1EN)
#define __HAL_RCC_SPI1_CLK_DISABLE()              CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_SPI1EN)
#if defined(TIM8)
#define __HAL_RCC_TIM8_CLK_DISABLE()              CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM8EN)
#endif /* TIM8 */
#define __HAL_RCC_USART1_CLK_DISABLE()            CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_USART1EN)
#if defined(TIM12)
#define __HAL_RCC_TIM12_CLK_DISABLE()             CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM12EN)
#endif /* TIM12 */
#define __HAL_RCC_TIM15_CLK_DISABLE()             CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM15EN)
#define __HAL_RCC_TIM16_CLK_DISABLE()             CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM16EN)
#define __HAL_RCC_TIM17_CLK_DISABLE()             CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM17EN)
#define __HAL_RCC_SAI1_CLK_DISABLE()              CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_SAI1EN)
#define __HAL_RCC_USB1_CLK_DISABLE()              CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_USB1EN)
#define __HAL_RCC_I3C2_CLK_DISABLE()              CLEAR_BIT(RCC->APB2ENR, RCC_APB2ENR_I3C2EN)
/**
  * @}
  */

/** @defgroup RCC_APB3_Clock_Enable_Disable APB3 Peripheral Clock Enable Disable
  * @brief  Enable or disable the APB3 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __HAL_RCC_SYSCFG_CLK_ENABLE()             do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB3ENR, RCC_APB3ENR_SYSCFGEN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB3ENR, RCC_APB3ENR_SYSCFGEN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_LPUART1_CLK_ENABLE()            do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB3ENR, RCC_APB3ENR_LPUART1EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB3ENR, RCC_APB3ENR_LPUART1EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_I2C3_CLK_ENABLE()               do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB3ENR, RCC_APB3ENR_I2C3EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB3ENR, RCC_APB3ENR_I2C3EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_LPTIM1_CLK_ENABLE()             do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB3ENR, RCC_APB3ENR_LPTIM1EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB3ENR, RCC_APB3ENR_LPTIM1EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_LPTIM3_CLK_ENABLE()             do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB3ENR, RCC_APB3ENR_LPTIM3EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB3ENR, RCC_APB3ENR_LPTIM3EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_LPTIM4_CLK_ENABLE()             do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB3ENR, RCC_APB3ENR_LPTIM4EN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB3ENR, RCC_APB3ENR_LPTIM4EN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_COMP_CLK_ENABLE()               do { \
                                                       __IO uint32_t tmpreg; \
                                                       SET_BIT(RCC->APB3ENR, RCC_APB3ENR_COMPEN); \
                                                       /* Delay after an RCC peripheral clock enabling */ \
                                                       tmpreg = READ_BIT(RCC->APB3ENR, RCC_APB3ENR_COMPEN); \
                                                       UNUSED(tmpreg); \
                                                     } while(0)

#define __HAL_RCC_SYSCFG_CLK_DISABLE()            CLEAR_BIT(RCC->APB3ENR, RCC_APB3ENR_SYSCFGEN)
#define __HAL_RCC_LPUART1_CLK_DISABLE()           CLEAR_BIT(RCC->APB3ENR, RCC_APB3ENR_LPUART1EN)
#define __HAL_RCC_I2C3_CLK_DISABLE()              CLEAR_BIT(RCC->APB3ENR, RCC_APB3ENR_I2C3EN)
#define __HAL_RCC_LPTIM1_CLK_DISABLE()            CLEAR_BIT(RCC->APB3ENR, RCC_APB3ENR_LPTIM1EN)
#define __HAL_RCC_LPTIM3_CLK_DISABLE()            CLEAR_BIT(RCC->APB3ENR, RCC_APB3ENR_LPTIM3EN)
#define __HAL_RCC_LPTIM4_CLK_DISABLE()            CLEAR_BIT(RCC->APB3ENR, RCC_APB3ENR_LPTIM4EN)
#define __HAL_RCC_COMP_CLK_DISABLE()              CLEAR_BIT(RCC->APB3ENR, RCC_APB3ENR_COMPEN)
/**
  * @}
  */

