stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc.h
/** @defgroup RCC_APB2_Peripheral_Clock_Enable_Disable_Status APB2 Peripheral Clock Enabled or Disabled Status
  * @brief  Check whether the APB2 peripheral clock is enabled or not.
  * @{
  */
#define __HAL_RCC_TIM1_IS_CLK_ENABLED()           (READ_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM1EN) != 0U)
#define __HAL_RCC_SPI1_IS_CLK_ENABLED()           (READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SPI1EN) != 0U)
#if defined(TIM8)
#define __HAL_RCC_TIM8_IS_CLK_ENABLED()           (READ_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM8EN) != 0U)
#endif /* TIM8 */
#define __HAL_RCC_USART1_IS_CLK_ENABLED()         (READ_BIT(RCC->APB2ENR, RCC_APB2ENR_USART1EN) != 0U)
#if defined(TIM12)
#define __HAL_RCC_TIM12_IS_CLK_ENABLED()          (READ_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM12EN) != 0U)
#endif /* TIM12 */
#define __HAL_RCC_TIM15_IS_CLK_ENABLED()          (READ_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM15EN) != 0U)
#define __HAL_RCC_TIM16_IS_CLK_ENABLED()          (READ_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM16EN) != 0U)
#define __HAL_RCC_TIM17_IS_CLK_ENABLED()          (READ_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM17EN) != 0U)
#define __HAL_RCC_SAI1_IS_CLK_ENABLED()           (READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SAI1EN) != 0U)
#define __HAL_RCC_USB1_IS_CLK_ENABLED()           (READ_BIT(RCC->APB2ENR, RCC_APB2ENR_USB1EN) != 0U)
#define __HAL_RCC_I3C2_IS_CLK_ENABLED()           (READ_BIT(RCC->APB2ENR, RCC_APB2ENR_I3C2EN) != 0U)
/**
  * @}
  */

/** @defgroup RCC_APB3_Peripheral_Clock_Enable_Disable_Status APB3 Peripheral Clock Enabled or Disabled Status
  * @brief  Check whether the APB3 peripheral clock is enabled or not.
  * @{
  */
#define __HAL_RCC_SYSCFG_IS_CLK_ENABLED()         (READ_BIT(RCC->APB3ENR, RCC_APB3ENR_SYSCFGEN) != 0U)
#define __HAL_RCC_LPUART1_IS_CLK_ENABLED()        (READ_BIT(RCC->APB3ENR, RCC_APB3ENR_LPUART1EN) != 0U)
#define __HAL_RCC_I2C3_IS_CLK_ENABLED()           (READ_BIT(RCC->APB3ENR, RCC_APB3ENR_I2C3EN) != 0U)
#define __HAL_RCC_LPTIM1_IS_CLK_ENABLED()         (READ_BIT(RCC->APB3ENR, RCC_APB3ENR_LPTIM1EN) != 0U)
#define __HAL_RCC_LPTIM3_IS_CLK_ENABLED()         (READ_BIT(RCC->APB3ENR, RCC_APB3ENR_LPTIM3EN) != 0U)
#define __HAL_RCC_LPTIM4_IS_CLK_ENABLED()         (READ_BIT(RCC->APB3ENR, RCC_APB3ENR_LPTIM4EN) != 0U)
#define __HAL_RCC_COMP_IS_CLK_ENABLED()           (READ_BIT(RCC->APB3ENR, RCC_APB3ENR_COMPEN) != 0U)
/**
  * @}
  */

/** @defgroup RCC_AHB1_Force_Release_Reset AHB1 Peripheral Force Release Reset
  * @brief  Force or release AHB1 peripheral reset.
  * @{
  */
#define __HAL_RCC_AHB1_FORCE_RESET()              WRITE_REG(RCC->AHB1RSTR1, 0xFFFFFFFFU)
#define __HAL_RCC_GPDMA1_FORCE_RESET()            SET_BIT(RCC->AHB1RSTR1, RCC_AHB1RSTR1_GPDMA1RST)
#define __HAL_RCC_ADF1_FORCE_RESET()              SET_BIT(RCC->AHB1RSTR1, RCC_AHB1RSTR1_ADF1RST)
#if defined(TIM12)
#define __HAL_RCC_HSP1_FORCE_RESET()              SET_BIT(RCC->AHB1RSTR1, RCC_AHB1RSTR1_HSP1RST)
#endif /* TIM12 */
#define __HAL_RCC_CRC_FORCE_RESET()               SET_BIT(RCC->AHB1RSTR1, RCC_AHB1RSTR1_CRCRST)
#define __HAL_RCC_TSC_FORCE_RESET()               SET_BIT(RCC->AHB1RSTR1, RCC_AHB1RSTR1_TSCRST)
#define __HAL_RCC_RAMCFG_FORCE_RESET()            SET_BIT(RCC->AHB1RSTR1, RCC_AHB1RSTR1_RAMCFGRST)

#define __HAL_RCC_AHB1_RELEASE_RESET()            WRITE_REG(RCC->AHB1RSTR1, 0x00000000U)
#define __HAL_RCC_GPDMA1_RELEASE_RESET()          CLEAR_BIT(RCC->AHB1RSTR1, RCC_AHB1RSTR1_GPDMA1RST)
#define __HAL_RCC_ADF1_RELEASE_RESET()            CLEAR_BIT(RCC->AHB1RSTR1, RCC_AHB1RSTR1_ADF1RST)
#if defined(TIM12)
#define __HAL_RCC_HSP1_RELEASE_RESET()            CLEAR_BIT(RCC->AHB1RSTR1, RCC_AHB1RSTR1_HSP1RST)
#endif /* TIM12 */
#define __HAL_RCC_CRC_RELEASE_RESET()             CLEAR_BIT(RCC->AHB1RSTR1, RCC_AHB1RSTR1_CRCRST)
#define __HAL_RCC_TSC_RELEASE_RESET()             CLEAR_BIT(RCC->AHB1RSTR1, RCC_AHB1RSTR1_TSCRST)
#define __HAL_RCC_RAMCFG_RELEASE_RESET()          CLEAR_BIT(RCC->AHB1RSTR1, RCC_AHB1RSTR1_RAMCFGRST)
/**
  * @}
  */

/** @defgroup RCC_AHB2_Force_Release_Reset AHB2 Peripheral Force Release Reset
  * @brief  Force or release AHB2 peripheral reset.
  * @{
  */
#define __HAL_RCC_AHB2_FORCE_RESET()              do { \
                                                       WRITE_REG(RCC->AHB2RSTR1, 0xFFFFFFFFU); \
                                                       WRITE_REG(RCC->AHB2RSTR2, 0xFFFFFFFFU); \
                                                     } while(0)
#define __HAL_RCC_GPIOA_FORCE_RESET()             SET_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_GPIOARST)
#define __HAL_RCC_GPIOB_FORCE_RESET()             SET_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_GPIOBRST)
#define __HAL_RCC_GPIOC_FORCE_RESET()             SET_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_GPIOCRST)
#define __HAL_RCC_GPIOD_FORCE_RESET()             SET_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_GPIODRST)
#define __HAL_RCC_GPIOE_FORCE_RESET()             SET_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_GPIOERST)
#if defined(GPIOF)
#define __HAL_RCC_GPIOF_FORCE_RESET()             SET_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_GPIOFRST)
#endif /* GPIOF */
#define __HAL_RCC_GPIOG_FORCE_RESET()             SET_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_GPIOGRST)
#define __HAL_RCC_GPIOH_FORCE_RESET()             SET_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_GPIOHRST)
#define __HAL_RCC_ADC12_FORCE_RESET()             SET_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_ADC12RST)
#define __HAL_RCC_DAC1_FORCE_RESET()              SET_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_DAC1RST)
#define __HAL_RCC_AES_FORCE_RESET()               SET_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_AESRST)
#define __HAL_RCC_HASH_FORCE_RESET()              SET_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_HASHRST)
#define __HAL_RCC_RNG_FORCE_RESET()               SET_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_RNGRST)
#define __HAL_RCC_PKA_FORCE_RESET()               SET_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_PKARST)
#define __HAL_RCC_SAES_FORCE_RESET()              SET_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_SAESRST)
#define __HAL_RCC_CCB_FORCE_RESET()               SET_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_CCBRST)
#define __HAL_RCC_SDMMC1_FORCE_RESET()            SET_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_SDMMC1RST)
#define __HAL_RCC_OCTOSPI1_FORCE_RESET()          SET_BIT(RCC->AHB2RSTR2, RCC_AHB2RSTR2_OCTOSPI1RST)

#define __HAL_RCC_AHB2_RELEASE_RESET()            do { \
                                                       WRITE_REG(RCC->AHB2RSTR1, 0x00000000U); \
                                                       WRITE_REG(RCC->AHB2RSTR2, 0x00000000U); \
                                                     } while(0)
#define __HAL_RCC_GPIOA_RELEASE_RESET()           CLEAR_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_GPIOARST)
#define __HAL_RCC_GPIOB_RELEASE_RESET()           CLEAR_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_GPIOBRST)
#define __HAL_RCC_GPIOC_RELEASE_RESET()           CLEAR_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_GPIOCRST)
#define __HAL_RCC_GPIOD_RELEASE_RESET()           CLEAR_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_GPIODRST)
#define __HAL_RCC_GPIOE_RELEASE_RESET()           CLEAR_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_GPIOERST)
#if defined(GPIOF)
#define __HAL_RCC_GPIOF_RELEASE_RESET()           CLEAR_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_GPIOFRST)
#endif /* GPIOF */
#define __HAL_RCC_GPIOG_RELEASE_RESET()           CLEAR_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_GPIOGRST)
#define __HAL_RCC_GPIOH_RELEASE_RESET()           CLEAR_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_GPIOHRST)
#define __HAL_RCC_ADC12_RELEASE_RESET()           CLEAR_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_ADC12RST)
#define __HAL_RCC_DAC1_RELEASE_RESET()            CLEAR_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_DAC1RST)
#define __HAL_RCC_AES_RELEASE_RESET()             CLEAR_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_AESRST)
#define __HAL_RCC_HASH_RELEASE_RESET()            CLEAR_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_HASHRST)
#define __HAL_RCC_RNG_RELEASE_RESET()             CLEAR_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_RNGRST)
#define __HAL_RCC_PKA_RELEASE_RESET()             CLEAR_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_PKARST)
#define __HAL_RCC_SAES_RELEASE_RESET()            CLEAR_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_SAESRST)
#define __HAL_RCC_CCB_RELEASE_RESET()             CLEAR_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_CCBRST)
#define __HAL_RCC_SDMMC1_RELEASE_RESET()          CLEAR_BIT(RCC->AHB2RSTR1, RCC_AHB2RSTR1_SDMMC1RST)
#define __HAL_RCC_OCTOSPI1_RELEASE_RESET()        CLEAR_BIT(RCC->AHB2RSTR2, RCC_AHB2RSTR2_OCTOSPI1RST)
/**
  * @}
  */

/** @defgroup RCC_APB1_Force_Release_Reset APB1 Peripheral Force Release Reset
  * @brief  Force or release APB1 peripheral reset.
  * @{
  */
#define __HAL_RCC_APB1_FORCE_RESET()              do { \
                                                       WRITE_REG(RCC->APB1RSTR1, 0xFFFFFFFFU); \
                                                       WRITE_REG(RCC->APB1RSTR2, 0xFFFFFFFFU); \
                                                     } while(0)
#define __HAL_RCC_TIM2_FORCE_RESET()              SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM2RST)
#define __HAL_RCC_TIM3_FORCE_RESET()              SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM3RST)
#define __HAL_RCC_TIM4_FORCE_RESET()              SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM4RST)
#define __HAL_RCC_TIM6_FORCE_RESET()              SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM6RST)
#define __HAL_RCC_TIM7_FORCE_RESET()              SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM7RST)
#define __HAL_RCC_SPI3_FORCE_RESET()              SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_SPI3RST)
#if defined(SPI4)
#define __HAL_RCC_SPI4_FORCE_RESET()              SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_SPI4RST)
#endif /* SPI4 */
#define __HAL_RCC_SPI2_FORCE_RESET()              SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_SPI2RST)
#if defined(USART2)
#define __HAL_RCC_USART2_FORCE_RESET()            SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_USART2RST)
#endif /* USART2 */
#define __HAL_RCC_USART3_FORCE_RESET()            SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_USART3RST)
#define __HAL_RCC_UART4_FORCE_RESET()             SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_UART4RST)
#define __HAL_RCC_UART5_FORCE_RESET()             SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_UART5RST)
#define __HAL_RCC_I2C1_FORCE_RESET()              SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_I2C1RST)
#define __HAL_RCC_I2C2_FORCE_RESET()              SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_I2C2RST)
#define __HAL_RCC_I3C1_FORCE_RESET()              SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_I3C1RST)
#define __HAL_RCC_CRS_FORCE_RESET()               SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_CRSRST)
#define __HAL_RCC_OPAMP_FORCE_RESET()             SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_OPAMPRST)
#define __HAL_RCC_VREF_FORCE_RESET()              SET_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_VREFRST)
#if defined(I2C4)
#define __HAL_RCC_I2C4_FORCE_RESET()              SET_BIT(RCC->APB1RSTR2, RCC_APB1RSTR2_I2C4RST)
#endif /* I2C4 */
#define __HAL_RCC_LPTIM2_FORCE_RESET()            SET_BIT(RCC->APB1RSTR2, RCC_APB1RSTR2_LPTIM2RST)
#define __HAL_RCC_FDCAN_FORCE_RESET()             SET_BIT(RCC->APB1RSTR2, RCC_APB1RSTR2_FDCANRST)
#define __HAL_RCC_APB1_RELEASE_RESET()            do { \
                                                       WRITE_REG(RCC->APB1RSTR1, 0x00000000U); \
                                                       WRITE_REG(RCC->APB1RSTR2, 0x00000000U); \
                                                     } while(0)
#define __HAL_RCC_TIM2_RELEASE_RESET()            CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM2RST)
#define __HAL_RCC_TIM3_RELEASE_RESET()            CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM3RST)
#define __HAL_RCC_TIM4_RELEASE_RESET()            CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM4RST)
#define __HAL_RCC_TIM6_RELEASE_RESET()            CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM6RST)
#define __HAL_RCC_TIM7_RELEASE_RESET()            CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_TIM7RST)
#define __HAL_RCC_SPI3_RELEASE_RESET()            CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_SPI3RST)
#if defined(SPI4)
#define __HAL_RCC_SPI4_RELEASE_RESET()            CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_SPI4RST)
#endif /* SPI4 */
#define __HAL_RCC_SPI2_RELEASE_RESET()            CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_SPI2RST)
#if defined(USART2)
#define __HAL_RCC_USART2_RELEASE_RESET()          CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_USART2RST)
#endif /* USART2 */
#define __HAL_RCC_USART3_RELEASE_RESET()          CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_USART3RST)
#define __HAL_RCC_UART4_RELEASE_RESET()           CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_UART4RST)
#define __HAL_RCC_UART5_RELEASE_RESET()           CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_UART5RST)
#define __HAL_RCC_I2C1_RELEASE_RESET()            CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_I2C1RST)
#define __HAL_RCC_I2C2_RELEASE_RESET()            CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_I2C2RST)
#define __HAL_RCC_I3C1_RELEASE_RESET()            CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_I3C1RST)
#define __HAL_RCC_CRS_RELEASE_RESET()             CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_CRSRST)
#define __HAL_RCC_OPAMP_RELEASE_RESET()           CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_OPAMPRST)
#define __HAL_RCC_VREF_RELEASE_RESET()            CLEAR_BIT(RCC->APB1RSTR1, RCC_APB1RSTR1_VREFRST)
#if defined(I2C4)
#define __HAL_RCC_I2C4_RELEASE_RESET()            CLEAR_BIT(RCC->APB1RSTR2, RCC_APB1RSTR2_I2C4RST)
#endif /* I2C4 */
#define __HAL_RCC_LPTIM2_RELEASE_RESET()          CLEAR_BIT(RCC->APB1RSTR2, RCC_APB1RSTR2_LPTIM2RST)
#define __HAL_RCC_FDCAN_RELEASE_RESET()           CLEAR_BIT(RCC->APB1RSTR2, RCC_APB1RSTR2_FDCANRST)
/**
  * @}
  */

/** @defgroup RCC_APB2_Force_Release_Reset APB2 Peripheral Force Release Reset
  * @brief  Force or release APB2 peripheral reset.
  * @{
  */
#define __HAL_RCC_APB2_FORCE_RESET()              WRITE_REG(RCC->APB2RSTR, 0xFFFFFFFFU)
#define __HAL_RCC_TIM1_FORCE_RESET()              SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_TIM1RST)
#define __HAL_RCC_SPI1_FORCE_RESET()              SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_SPI1RST)
#if defined(TIM8)
#define __HAL_RCC_TIM8_FORCE_RESET()             SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_TIM8RST)
#endif /* TIM8 */
#define __HAL_RCC_USART1_FORCE_RESET()            SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_USART1RST)
#if defined(TIM12)
#define __HAL_RCC_TIM12_FORCE_RESET()             SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_TIM12RST)
#endif /* TIM12 */
#define __HAL_RCC_TIM15_FORCE_RESET()             SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_TIM15RST)
#define __HAL_RCC_TIM16_FORCE_RESET()             SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_TIM16RST)
#define __HAL_RCC_TIM17_FORCE_RESET()             SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_TIM17RST)
#define __HAL_RCC_SAI1_FORCE_RESET()              SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_SAI1RST)
#define __HAL_RCC_USB1_FORCE_RESET()              SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_USB1RST)
#define __HAL_RCC_I3C2_FORCE_RESET()              SET_BIT(RCC->APB2RSTR, RCC_APB2RSTR_I3C2RST)

#define __HAL_RCC_APB2_RELEASE_RESET()            WRITE_REG(RCC->APB2RSTR, 0x00000000U)
#define __HAL_RCC_TIM1_RELEASE_RESET()            CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_TIM1RST)
#define __HAL_RCC_SPI1_RELEASE_RESET()            CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_SPI1RST)
#if defined(TIM8)
#define __HAL_RCC_TIM8_RELEASE_RESET()            CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_TIM8RST)
#endif /* TIM8 */
#define __HAL_RCC_USART1_RELEASE_RESET()          CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_USART1RST)
#if defined(TIM12)
#define __HAL_RCC_TIM12_RELEASE_RESET()           CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_TIM12RST)
#endif /* TIM12 */
#define __HAL_RCC_TIM15_RELEASE_RESET()           CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_TIM15RST)
#define __HAL_RCC_TIM16_RELEASE_RESET()           CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_TIM16RST)
#define __HAL_RCC_TIM17_RELEASE_RESET()           CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_TIM17RST)
#define __HAL_RCC_SAI1_RELEASE_RESET()            CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_SAI1RST)
#define __HAL_RCC_USB1_RELEASE_RESET()            CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_USB1RST)
#define __HAL_RCC_I3C2_RELEASE_RESET()            CLEAR_BIT(RCC->APB2RSTR, RCC_APB2RSTR_I3C2RST)
/**
  * @}
  */

