stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc.h
/** @defgroup RCC_APB3_Force_Release_Reset APB3 Peripheral Force Release Reset
  * @brief  Force or release APB3 peripheral reset.
  * @{
  */
#define __HAL_RCC_APB3_FORCE_RESET()              WRITE_REG(RCC->APB3RSTR, 0xFFFFFFFFU)
#define __HAL_RCC_SYSCFG_FORCE_RESET()            SET_BIT(RCC->APB3RSTR, RCC_APB3RSTR_SYSCFGRST)
#define __HAL_RCC_LPUART1_FORCE_RESET()           SET_BIT(RCC->APB3RSTR, RCC_APB3RSTR_LPUART1RST)
#define __HAL_RCC_I2C3_FORCE_RESET()              SET_BIT(RCC->APB3RSTR, RCC_APB3RSTR_I2C3RST)
#define __HAL_RCC_LPTIM1_FORCE_RESET()            SET_BIT(RCC->APB3RSTR, RCC_APB3RSTR_LPTIM1RST)
#define __HAL_RCC_LPTIM3_FORCE_RESET()            SET_BIT(RCC->APB3RSTR, RCC_APB3RSTR_LPTIM3RST)
#define __HAL_RCC_LPTIM4_FORCE_RESET()            SET_BIT(RCC->APB3RSTR, RCC_APB3RSTR_LPTIM4RST)
#define __HAL_RCC_COMP_FORCE_RESET()              SET_BIT(RCC->APB3RSTR, RCC_APB3RSTR_COMPRST)

#define __HAL_RCC_APB3_RELEASE_RESET()            WRITE_REG(RCC->APB3RSTR, 0x00000000U)
#define __HAL_RCC_SYSCFG_RELEASE_RESET()          CLEAR_BIT(RCC->APB3RSTR, RCC_APB3RSTR_SYSCFGRST)
#define __HAL_RCC_LPUART1_RELEASE_RESET()         CLEAR_BIT(RCC->APB3RSTR, RCC_APB3RSTR_LPUART1RST)
#define __HAL_RCC_I2C3_RELEASE_RESET()            CLEAR_BIT(RCC->APB3RSTR, RCC_APB3RSTR_I2C3RST)
#define __HAL_RCC_LPTIM1_RELEASE_RESET()          CLEAR_BIT(RCC->APB3RSTR, RCC_APB3RSTR_LPTIM1RST)
#define __HAL_RCC_LPTIM3_RELEASE_RESET()          CLEAR_BIT(RCC->APB3RSTR, RCC_APB3RSTR_LPTIM3RST)
#define __HAL_RCC_LPTIM4_RELEASE_RESET()          CLEAR_BIT(RCC->APB3RSTR, RCC_APB3RSTR_LPTIM4RST)
#define __HAL_RCC_COMP_RELEASE_RESET()            CLEAR_BIT(RCC->APB3RSTR, RCC_APB3RSTR_COMPRST)
/**
  * @}
  */

/** @defgroup RCC_AHB1_Peripheral_Clock_Sleep_Enable_Disable AHB1 Peripheral Clock Sleep Enable Disable
  * @brief  Enable or disable the AHB1 peripheral clock during Sleep mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */
#define __HAL_RCC_GPDMA1_CLK_SLEEP_ENABLE()       SET_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_GPDMA1SLPEN)
#define __HAL_RCC_ADF1_CLK_SLEEP_ENABLE()         SET_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_ADF1SLPEN)
#if defined(HSP1)
#define __HAL_RCC_HSP1_CLK_SLEEP_ENABLE()         SET_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_HSP1SLPEN)
#endif /* HSP1 */
#define __HAL_RCC_FLASH_CLK_SLEEP_ENABLE()        SET_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_FLASHSLPEN)
#define __HAL_RCC_CRC_CLK_SLEEP_ENABLE()          SET_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_CRCSLPEN)
#define __HAL_RCC_TSC_CLK_SLEEP_ENABLE()          SET_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_TSCSLPEN)
#define __HAL_RCC_RAMCFG_CLK_SLEEP_ENABLE()       SET_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_RAMCFGSLPEN)
#define __HAL_RCC_GTZC1_CLK_SLEEP_ENABLE()        SET_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_GTZC1SLPEN)
#define __HAL_RCC_ICACHE_CLK_SLEEP_ENABLE()       SET_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_ICACHESLPEN)
#if defined(SRAM4)
#define __HAL_RCC_SRAM4_CLK_SLEEP_ENABLE()        SET_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_SRAM4SLPEN)
#endif /* SRAM4 */
#define __HAL_RCC_SRAM1_CLK_SLEEP_ENABLE()        SET_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_SRAM1SLPEN)
#define __HAL_RCC_PWR_CLK_SLEEP_ENABLE()          SET_BIT(RCC->AHB1SLPENR2, RCC_AHB1SLPENR2_PWRSLPEN)

#define __HAL_RCC_GPDMA1_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_GPDMA1SLPEN)
#define __HAL_RCC_ADF1_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_ADF1SLPEN)
#if defined(HSP1)
#define __HAL_RCC_HSP1_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_HSP1SLPEN)
#endif /* HSP1 */
#define __HAL_RCC_FLASH_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_FLASHSLPEN)
#define __HAL_RCC_CRC_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_CRCSLPEN)
#define __HAL_RCC_TSC_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_TSCSLPEN)
#define __HAL_RCC_RAMCFG_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_RAMCFGSLPEN)
#define __HAL_RCC_GTZC1_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_GTZC1SLPEN)
#define __HAL_RCC_ICACHE_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_ICACHESLPEN)
#if defined(SRAM4)
#define __HAL_RCC_SRAM4_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_SRAM4SLPEN)
#endif /* SRAM4 */
#define __HAL_RCC_SRAM1_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_SRAM1SLPEN)
#define __HAL_RCC_PWR_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->AHB1SLPENR2, RCC_AHB1SLPENR2_PWRSLPEN)
/**
  * @}
  */

/** @defgroup RCC_AHB2_Peripheral_Clock_Sleep_Enable_Disable AHB2 Peripheral Clock Sleep Enable Disable
  * @brief  Enable or disable the AHB2 peripheral clock during Sleep mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */
#define __HAL_RCC_GPIOA_CLK_SLEEP_ENABLE()        SET_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIOASLPEN)
#define __HAL_RCC_GPIOB_CLK_SLEEP_ENABLE()        SET_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIOBSLPEN)
#define __HAL_RCC_GPIOC_CLK_SLEEP_ENABLE()        SET_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIOCSLPEN)
#define __HAL_RCC_GPIOD_CLK_SLEEP_ENABLE()        SET_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIODSLPEN)
#define __HAL_RCC_GPIOE_CLK_SLEEP_ENABLE()        SET_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIOESLPEN)
#if defined(GPIOF)
#define __HAL_RCC_GPIOF_CLK_SLEEP_ENABLE()        SET_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIOFSLPEN)
#endif /* GPIOF */
#define __HAL_RCC_GPIOG_CLK_SLEEP_ENABLE()        SET_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIOGSLPEN)
#define __HAL_RCC_GPIOH_CLK_SLEEP_ENABLE()        SET_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIOHSLPEN)
#define __HAL_RCC_ADC12_CLK_SLEEP_ENABLE()        SET_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_ADC12SLPEN)
#define __HAL_RCC_DAC1_CLK_SLEEP_ENABLE()         SET_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_DAC1SLPEN)
#define __HAL_RCC_AES_CLK_SLEEP_ENABLE()          SET_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_AESSLPEN)
#define __HAL_RCC_HASH_CLK_SLEEP_ENABLE()         SET_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_HASHSLPEN)
#define __HAL_RCC_RNG_CLK_SLEEP_ENABLE()          SET_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_RNGSLPEN)
#define __HAL_RCC_PKA_CLK_SLEEP_ENABLE()          SET_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_PKASLPEN)
#define __HAL_RCC_SAES_CLK_SLEEP_ENABLE()         SET_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_SAESSLPEN)
#define __HAL_RCC_CCB_CLK_SLEEP_ENABLE()          SET_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_CCBSLPEN)
#define __HAL_RCC_SDMMC1_CLK_SLEEP_ENABLE()       SET_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_SDMMC1SLPEN)
#define __HAL_RCC_SRAM2_CLK_SLEEP_ENABLE()        SET_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_SRAM2SLPEN)
#if defined(SRAM3)
#define __HAL_RCC_SRAM3_CLK_SLEEP_ENABLE()        SET_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_SRAM3SLPEN)
#endif /* SRAM3 */
#define __HAL_RCC_OCTOSPI1_CLK_SLEEP_ENABLE()     SET_BIT(RCC->AHB2SLPENR2, RCC_AHB2SLPENR2_OCTOSPI1SLPEN)

