stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc.h
#define __HAL_RCC_GPIOA_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIOASLPEN)
#define __HAL_RCC_GPIOB_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIOBSLPEN)
#define __HAL_RCC_GPIOC_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIOCSLPEN)
#define __HAL_RCC_GPIOD_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIODSLPEN)
#define __HAL_RCC_GPIOE_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIOESLPEN)
#if defined(GPIOF)
#define __HAL_RCC_GPIOF_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIOFSLPEN)
#endif /* GPIOF */
#define __HAL_RCC_GPIOG_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIOGSLPEN)
#define __HAL_RCC_GPIOH_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIOHSLPEN)
#define __HAL_RCC_ADC12_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_ADC12SLPEN)
#define __HAL_RCC_DAC1_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_DAC1SLPEN)
#define __HAL_RCC_AES_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_AESSLPEN)
#define __HAL_RCC_HASH_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_HASHSLPEN)
#define __HAL_RCC_RNG_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_RNGSLPEN)
#define __HAL_RCC_PKA_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_PKASLPEN)
#define __HAL_RCC_SAES_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_SAESSLPEN)
#define __HAL_RCC_CCB_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_CCBSLPEN)
#define __HAL_RCC_SDMMC1_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_SDMMC1SLPEN)
#define __HAL_RCC_SRAM2_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_SRAM2SLPEN)
#if defined(SRAM3)
#define __HAL_RCC_SRAM3_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_SRAM3SLPEN)
#endif /* SRAM3 */
#define __HAL_RCC_OCTOSPI1_CLK_SLEEP_DISABLE()    CLEAR_BIT(RCC->AHB2SLPENR2, RCC_AHB2SLPENR2_OCTOSPI1SLPEN)
/**
  * @}
  */
/** @defgroup RCC_APB1_Peripheral_Clock_Sleep_Enable_Disable APB1 Peripheral Clock Sleep Enable Disable
  * @brief  Enable or disable the APB1 peripheral clock during Sleep mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */
#define __HAL_RCC_TIM2_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_TIM2SLPEN)
#define __HAL_RCC_TIM3_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_TIM3SLPEN)
#define __HAL_RCC_TIM4_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_TIM4SLPEN)
#define __HAL_RCC_TIM6_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_TIM6SLPEN)
#define __HAL_RCC_TIM7_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_TIM7SLPEN)
#define __HAL_RCC_SPI3_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_SPI3SLPEN)
#if defined(SPI4)
#define __HAL_RCC_SPI4_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_SPI4SLPEN)
#endif /* SPI4 */
#define __HAL_RCC_WWDG_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_WWDGSLPEN)
#define __HAL_RCC_SPI2_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_SPI2SLPEN)
#if defined(USART2)
#define __HAL_RCC_USART2_CLK_SLEEP_ENABLE()       SET_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_USART2SLPEN)
#endif /* USART2 */
#define __HAL_RCC_USART3_CLK_SLEEP_ENABLE()       SET_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_USART3SLPEN)
#define __HAL_RCC_UART4_CLK_SLEEP_ENABLE()        SET_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_UART4SLPEN)
#define __HAL_RCC_UART5_CLK_SLEEP_ENABLE()        SET_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_UART5SLPEN)
#define __HAL_RCC_I2C1_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_I2C1SLPEN)
#define __HAL_RCC_I2C2_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_I2C2SLPEN)
#define __HAL_RCC_I3C1_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_I3C1SLPEN)
#define __HAL_RCC_CRS_CLK_SLEEP_ENABLE()          SET_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_CRSSLPEN)
#define __HAL_RCC_OPAMP_CLK_SLEEP_ENABLE()        SET_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_OPAMPSLPEN)
#define __HAL_RCC_VREF_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_VREFSLPEN)
#define __HAL_RCC_RTCAPB_CLK_SLEEP_ENABLE()       SET_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_RTCAPBSLPEN)
#if defined(I2C4)
#define __HAL_RCC_I2C4_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APB1SLPENR2, RCC_APB1SLPENR2_I2C4SLPEN)
#endif /* I2C4 */
#define __HAL_RCC_LPTIM2_CLK_SLEEP_ENABLE()       SET_BIT(RCC->APB1SLPENR2, RCC_APB1SLPENR2_LPTIM2SLPEN)
#define __HAL_RCC_FDCAN_CLK_SLEEP_ENABLE()        SET_BIT(RCC->APB1SLPENR2, RCC_APB1SLPENR2_FDCANSLPEN)

#define __HAL_RCC_TIM2_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_TIM2SLPEN)
#define __HAL_RCC_TIM3_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_TIM3SLPEN)
#define __HAL_RCC_TIM4_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_TIM4SLPEN)
#define __HAL_RCC_TIM6_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_TIM6SLPEN)
#define __HAL_RCC_TIM7_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_TIM7SLPEN)
#define __HAL_RCC_SPI3_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_SPI3SLPEN)
#if defined(SPI4)
#define __HAL_RCC_SPI4_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_SPI4SLPEN)
#endif /* SPI4 */
#define __HAL_RCC_WWDG_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_WWDGSLPEN)
#define __HAL_RCC_SPI2_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_SPI2SLPEN)
#if defined(USART2)
#define __HAL_RCC_USART2_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_USART2SLPEN)
#endif /* USART2 */
#define __HAL_RCC_USART3_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_USART3SLPEN)
#define __HAL_RCC_UART4_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_UART4SLPEN)
#define __HAL_RCC_UART5_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_UART5SLPEN)
#define __HAL_RCC_I2C1_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_I2C1SLPEN)
#define __HAL_RCC_I2C2_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_I2C2SLPEN)
#define __HAL_RCC_I3C1_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_I3C1SLPEN)
#define __HAL_RCC_CRS_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_CRSSLPEN)
#define __HAL_RCC_OPAMP_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_OPAMPSLPEN)
#define __HAL_RCC_VREF_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_VREFSLPEN)
#define __HAL_RCC_RTCAPB_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_RTCAPBSLPEN)
#if defined(I2C4)
#define __HAL_RCC_I2C4_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APB1SLPENR2, RCC_APB1SLPENR2_I2C4SLPEN)
#endif /* I2C4 */
#define __HAL_RCC_LPTIM2_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->APB1SLPENR2, RCC_APB1SLPENR2_LPTIM2SLPEN)
#define __HAL_RCC_FDCAN_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->APB1SLPENR2, RCC_APB1SLPENR2_FDCANSLPEN)
/**
  * @}
  */

/** @defgroup RCC_APB2_Peripheral_Clock_Sleep_Enable_Disable APB2 Peripheral Clock Sleep Enable Disable
  * @brief  Enable or disable the APB2 peripheral clock during Sleep mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */
#define __HAL_RCC_TIM1_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_TIM1SLPEN)
#define __HAL_RCC_SPI1_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_SPI1SLPEN)
#if defined(TIM8)
#define __HAL_RCC_TIM8_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_TIM8SLPEN)
#endif /* TIM8 */
#define __HAL_RCC_USART1_CLK_SLEEP_ENABLE()       SET_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_USART1SLPEN)
#if defined(TIM12)
#define __HAL_RCC_TIM12_CLK_SLEEP_ENABLE()        SET_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_TIM12SLPEN)
#endif /* TIM12 */
#define __HAL_RCC_TIM15_CLK_SLEEP_ENABLE()        SET_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_TIM15SLPEN)
#define __HAL_RCC_TIM16_CLK_SLEEP_ENABLE()        SET_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_TIM16SLPEN)
#define __HAL_RCC_TIM17_CLK_SLEEP_ENABLE()        SET_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_TIM17SLPEN)
#define __HAL_RCC_SAI1_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_SAI1SLPEN)
#define __HAL_RCC_USB1_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_USB1SLPEN)
#define __HAL_RCC_I3C2_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_I3C2SLPEN)

