stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc.h
#define __HAL_RCC_TIM1_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_TIM1SLPEN)
#define __HAL_RCC_SPI1_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_SPI1SLPEN)
#if defined(TIM8)
#define __HAL_RCC_TIM8_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_TIM8SLPEN)
#endif /* TIM8 */
#define __HAL_RCC_USART1_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_USART1SLPEN)
#if defined(TIM12)
#define __HAL_RCC_TIM12_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_TIM12SLPEN)
#endif /* TIM12 */
#define __HAL_RCC_TIM15_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_TIM15SLPEN)
#define __HAL_RCC_TIM16_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_TIM16SLPEN)
#define __HAL_RCC_TIM17_CLK_SLEEP_DISABLE()       CLEAR_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_TIM17SLPEN)
#define __HAL_RCC_SAI1_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_SAI1SLPEN)
#define __HAL_RCC_USB1_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_USB1SLPEN)
#define __HAL_RCC_I3C2_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_I3C2SLPEN)
/**
  * @}
  */

/** @defgroup RCC_APB3_Peripheral_Clock_Sleep_Enable_Disable APB3 Peripheral Clock Sleep Enable Disable
  * @brief  Enable or disable the APB3 peripheral clock during Sleep mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */
#define __HAL_RCC_SYSCFG_CLK_SLEEP_ENABLE()       SET_BIT(RCC->APB3SLPENR, RCC_APB3SLPENR_SYSCFGSLPEN)
#define __HAL_RCC_LPUART1_CLK_SLEEP_ENABLE()      SET_BIT(RCC->APB3SLPENR, RCC_APB3SLPENR_LPUART1SLPEN)
#define __HAL_RCC_I2C3_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APB3SLPENR, RCC_APB3SLPENR_I2C3SLPEN)
#define __HAL_RCC_LPTIM1_CLK_SLEEP_ENABLE()       SET_BIT(RCC->APB3SLPENR, RCC_APB3SLPENR_LPTIM1SLPEN)
#define __HAL_RCC_LPTIM3_CLK_SLEEP_ENABLE()       SET_BIT(RCC->APB3SLPENR, RCC_APB3SLPENR_LPTIM3SLPEN)
#define __HAL_RCC_LPTIM4_CLK_SLEEP_ENABLE()       SET_BIT(RCC->APB3SLPENR, RCC_APB3SLPENR_LPTIM4SLPEN)
#define __HAL_RCC_COMP_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APB3SLPENR, RCC_APB3SLPENR_COMPSLPEN)

#define __HAL_RCC_SYSCFG_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->APB3SLPENR, RCC_APB3SLPENR_SYSCFGSLPEN)
#define __HAL_RCC_LPUART1_CLK_SLEEP_DISABLE()     CLEAR_BIT(RCC->APB3SLPENR, RCC_APB3SLPENR_LPUART1SLPEN)
#define __HAL_RCC_I2C3_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APB3SLPENR, RCC_APB3SLPENR_I2C3SLPEN)
#define __HAL_RCC_LPTIM1_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->APB3SLPENR, RCC_APB3SLPENR_LPTIM1SLPEN)
#define __HAL_RCC_LPTIM3_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->APB3SLPENR, RCC_APB3SLPENR_LPTIM3SLPEN)
#define __HAL_RCC_LPTIM4_CLK_SLEEP_DISABLE()      CLEAR_BIT(RCC->APB3SLPENR, RCC_APB3SLPENR_LPTIM4SLPEN)
#define __HAL_RCC_COMP_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APB3SLPENR, RCC_APB3SLPENR_COMPSLPEN)
/**
  * @}
  */

/** @defgroup RCC_AHB1_Peripheral_Clock_Sleep_Enabled_Status AHB1 Peripheral Clock Sleep Enabled Status
  * @brief  Check whether the AHB1 peripheral clock during Low Power (Sleep) is enabled or not.
  * @{
  */
#define __HAL_RCC_GPDMA1_IS_CLK_SLEEP_ENABLED()   (READ_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_GPDMA1SLPEN) != 0U)
#define __HAL_RCC_ADF1_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_ADF1SLPEN) != 0U)
#if defined(HSP1)
#define __HAL_RCC_HSP1_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_HSP1SLPEN) != 0U)
#endif /* HSP1 */
#define __HAL_RCC_FLASH_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_FLASHSLPEN) != 0U)
#define __HAL_RCC_CRC_IS_CLK_SLEEP_ENABLED()      (READ_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_CRCSLPEN) != 0U)
#define __HAL_RCC_TSC_IS_CLK_SLEEP_ENABLED()      (READ_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_TSCSLPEN) != 0U)
#define __HAL_RCC_RAMCFG_IS_CLK_SLEEP_ENABLED()   (READ_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_RAMCFGSLPEN) != 0U)
#define __HAL_RCC_GTZC1_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_GTZC1SLPEN) != 0U)
#define __HAL_RCC_ICACHE_IS_CLK_SLEEP_ENABLED()   (READ_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_ICACHESLPEN) != 0U)
#if defined(SRAM4)
#define __HAL_RCC_SRAM4_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_SRAM4SLPEN) != 0U)
#endif /* SRAM4 */
#define __HAL_RCC_SRAM1_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->AHB1SLPENR1, RCC_AHB1SLPENR1_SRAM1SLPEN) != 0U)
#define __HAL_RCC_PWR_IS_CLK_SLEEP_ENABLED()      (READ_BIT(RCC->AHB1SLPENR2, RCC_AHB1SLPENR2_PWRSLPEN) != 0U)
/**
  * @}
  */

/** @defgroup RCC_AHB2_Peripheral_Clock_Sleep_Enabled_Status AHB2 Peripheral Clock Sleep Enabled Status
  * @brief  Check whether the AHB2 peripheral clock during Low Power (Sleep) is enabled or not.
  * @{
  */
#define __HAL_RCC_GPIOA_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIOASLPEN) != 0U)
#define __HAL_RCC_GPIOB_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIOBSLPEN) != 0U)
#define __HAL_RCC_GPIOC_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIOCSLPEN) != 0U)
#define __HAL_RCC_GPIOD_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIODSLPEN) != 0U)
#define __HAL_RCC_GPIOE_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIOESLPEN) != 0U)
#if defined(GPIOF)
#define __HAL_RCC_GPIOF_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIOFSLPEN) != 0U)
#endif /* GPIOF */
#define __HAL_RCC_GPIOG_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIOGSLPEN) != 0U)
#define __HAL_RCC_GPIOH_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_GPIOHSLPEN) != 0U)
#define __HAL_RCC_ADC12_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_ADC12SLPEN) != 0U)
#define __HAL_RCC_DAC1_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_DAC1SLPEN) != 0U)
#define __HAL_RCC_AES_IS_CLK_SLEEP_ENABLED()      (READ_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_AESSLPEN) != 0U)
#define __HAL_RCC_HASH_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_HASHSLPEN) != 0U)
#define __HAL_RCC_RNG_IS_CLK_SLEEP_ENABLED()      (READ_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_RNGSLPEN) != 0U)
#define __HAL_RCC_PKA_IS_CLK_SLEEP_ENABLED()      (READ_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_PKASLPEN) != 0U)
#define __HAL_RCC_SAES_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_SAESSLPEN) != 0U)
#define __HAL_RCC_CCB_IS_CLK_SLEEP_ENABLED()      (READ_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_CCBSLPEN) != 0U)
#define __HAL_RCC_SDMMC1_IS_CLK_SLEEP_ENABLED()   (READ_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_SDMMC1SLPEN) != 0U)
#define __HAL_RCC_SRAM2_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_SRAM2SLPEN) != 0U)
#if defined(SRAM3)
#define __HAL_RCC_SRAM3_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->AHB2SLPENR1, RCC_AHB2SLPENR1_SRAM3SLPEN) != 0U)
#endif /* SRAM3 */
#define __HAL_RCC_OCTOSPI1_IS_CLK_SLEEP_ENABLED() (READ_BIT(RCC->AHB2SLPENR2, RCC_AHB2SLPENR2_OCTOSPI1SLPEN) != 0U)
/**
  * @}
  */

/** @defgroup RCC_APB1_Peripheral_Clock_Sleep_Enabled_Status APB1 Peripheral Clock Sleep Enabled Status
  * @brief  Check whether the APB1 peripheral clock during Low Power (Sleep) is enabled or not.
  * @{
  */
#define __HAL_RCC_TIM2_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_TIM2SLPEN) != 0U)
#define __HAL_RCC_TIM3_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_TIM3SLPEN) != 0U)
#define __HAL_RCC_TIM4_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_TIM4SLPEN) != 0U)
#define __HAL_RCC_TIM6_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_TIM6SLPEN) != 0U)
#define __HAL_RCC_TIM7_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_TIM7SLPEN) != 0U)
#define __HAL_RCC_SPI3_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_SPI3SLPEN) != 0U)
#if defined(SPI4)
#define __HAL_RCC_SPI4_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_SPI4SLPEN) != 0U)
#endif /* SPI4 */
#define __HAL_RCC_WWDG_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_WWDGSLPEN) != 0U)
#define __HAL_RCC_SPI2_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_SPI2SLPEN) != 0U)
#if defined(USART2)
#define __HAL_RCC_USART2_IS_CLK_SLEEP_ENABLED()   (READ_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_USART2SLPEN) != 0U)
#endif /* USART2 */
#define __HAL_RCC_USART3_IS_CLK_SLEEP_ENABLED()   (READ_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_USART3SLPEN) != 0U)
#define __HAL_RCC_UART4_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_UART4SLPEN) != 0U)
#define __HAL_RCC_UART5_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_UART5SLPEN) != 0U)
#define __HAL_RCC_I2C1_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_I2C1SLPEN) != 0U)
#define __HAL_RCC_I2C2_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_I2C2SLPEN) != 0U)
#define __HAL_RCC_I3C1_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_I3C1SLPEN) != 0U)
#define __HAL_RCC_CRS_IS_CLK_SLEEP_ENABLED()      (READ_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_CRSSLPEN) != 0U)
#define __HAL_RCC_OPAMP_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_OPAMPSLPEN) != 0U)
#define __HAL_RCC_VREF_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_VREFSLPEN) != 0U)
#define __HAL_RCC_RTCAPB_IS_CLK_SLEEP_ENABLED()   (READ_BIT(RCC->APB1SLPENR1, RCC_APB1SLPENR1_RTCAPBSLPEN) != 0U)
#if defined(I2C4)
#define __HAL_RCC_I2C4_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->APB1SLPENR2, RCC_APB1SLPENR2_I2C4SLPEN) != 0U)
#endif /* I2C4 */
#define __HAL_RCC_LPTIM2_IS_CLK_SLEEP_ENABLED()   (READ_BIT(RCC->APB1SLPENR2, RCC_APB1SLPENR2_LPTIM2SLPEN) != 0U)
#define __HAL_RCC_FDCAN_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->APB1SLPENR2, RCC_APB1SLPENR2_FDCANSLPEN) != 0U)
/**
  * @}
  */

/** @defgroup RCC_APB2_Peripheral_Clock_Sleep_Enabled_Status APB2 Peripheral Clock Sleep Enabled Status
  * @brief  Check whether the APB2 peripheral clock during Low Power (Sleep) mode is enabled or not.
  * @{
  */
#define __HAL_RCC_TIM1_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_TIM1SLPEN) != 0U)
#define __HAL_RCC_SPI1_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_SPI1SLPEN) != 0U)
#if defined(TIM8)
#define __HAL_RCC_TIM8_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_TIM8SLPEN) != 0U)
#endif /* TIM8 */
#define __HAL_RCC_USART1_IS_CLK_SLEEP_ENABLED()   (READ_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_USART1SLPEN) != 0U)
#if defined(TIM12)
#define __HAL_RCC_TIM12_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_TIM12SLPEN) != 0U)
#endif /* TIM12 */
#define __HAL_RCC_TIM15_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_TIM15SLPEN) != 0U)
#define __HAL_RCC_TIM16_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_TIM16SLPEN) != 0U)
#define __HAL_RCC_TIM17_IS_CLK_SLEEP_ENABLED()    (READ_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_TIM17SLPEN) != 0U)
#define __HAL_RCC_SAI1_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_SAI1SLPEN) != 0U)
#define __HAL_RCC_USB1_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_USB1SLPEN) != 0U)
#define __HAL_RCC_I3C2_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->APB2SLPENR, RCC_APB2SLPENR_I3C2SLPEN) != 0U)
/**
  * @}
  */

/** @defgroup RCC_APB3_Peripheral_Clock_Sleep_Enabled_Status APB3 Peripheral Clock Sleep Enabled Status
  * @brief  Check whether the APB3 peripheral clock during Low Power (Sleep) mode is enabled or not.
  * @{
  */
#define __HAL_RCC_SYSCFG_IS_CLK_SLEEP_ENABLED()   (READ_BIT(RCC->APB3SLPENR, RCC_APB3SLPENR_SYSCFGSLPEN) != 0U)
#define __HAL_RCC_LPUART1_IS_CLK_SLEEP_ENABLED()  (READ_BIT(RCC->APB3SLPENR, RCC_APB3SLPENR_LPUART1SLPEN) != 0U)
#define __HAL_RCC_I2C3_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->APB3SLPENR, RCC_APB3SLPENR_I2C3SLPEN) != 0U)
#define __HAL_RCC_LPTIM1_IS_CLK_SLEEP_ENABLED()   (READ_BIT(RCC->APB3SLPENR, RCC_APB3SLPENR_LPTIM1SLPEN) != 0U)
#define __HAL_RCC_LPTIM3_IS_CLK_SLEEP_ENABLED()   (READ_BIT(RCC->APB3SLPENR, RCC_APB3SLPENR_LPTIM3SLPEN) != 0U)
#define __HAL_RCC_LPTIM4_IS_CLK_SLEEP_ENABLED()   (READ_BIT(RCC->APB3SLPENR, RCC_APB3SLPENR_LPTIM4SLPEN) != 0U)
#define __HAL_RCC_COMP_IS_CLK_SLEEP_ENABLED()     (READ_BIT(RCC->APB3SLPENR, RCC_APB3SLPENR_COMPSLPEN) != 0U)
/**
  * @}
  */

/** @defgroup RCC_AHB1_Peripheral_Clock_Stop_Enable_Disable AHB1 Peripheral Clock Stop Enable Disable
  * @brief  Enable or disable the AHB1 peripheral clock during Stop mode.
  * @note   Peripheral clock gating in STOP mode can be used to further reduce
  *         power consumption.
  * @note   By default, all peripheral clocks are enabled during STOP mode.
  * @{
  */
#define __HAL_RCC_GPDMA1_CLK_STOP_ENABLE()        SET_BIT(RCC->AHB1STPENR1, RCC_AHB1STPENR1_GPDMA1STPEN)
#define __HAL_RCC_ADF1_CLK_STOP_ENABLE()          SET_BIT(RCC->AHB1STPENR1, RCC_AHB1STPENR1_ADF1STPEN)
#define __HAL_RCC_FLASH_CLK_STOP_ENABLE()         SET_BIT(RCC->AHB1STPENR1, RCC_AHB1STPENR1_FLASHSTPEN)
#define __HAL_RCC_RAMCFG_CLK_STOP_ENABLE()        SET_BIT(RCC->AHB1STPENR1, RCC_AHB1STPENR1_RAMCFGSTPEN)
#define __HAL_RCC_GTZC1_CLK_STOP_ENABLE()         SET_BIT(RCC->AHB1STPENR1, RCC_AHB1STPENR1_GTZC1STPEN)
#if defined(SRAM4)
#define __HAL_RCC_SRAM4_CLK_STOP_ENABLE()         SET_BIT(RCC->AHB1STPENR1, RCC_AHB1STPENR1_SRAM4STPEN)
#endif /* SRAM4 */
#define __HAL_RCC_SRAM1_CLK_STOP_ENABLE()         SET_BIT(RCC->AHB1STPENR1, RCC_AHB1STPENR1_SRAM1STPEN)

#define __HAL_RCC_GPDMA1_CLK_STOP_DISABLE()       CLEAR_BIT(RCC->AHB1STPENR1, RCC_AHB1STPENR1_GPDMA1STPEN)
#define __HAL_RCC_ADF1_CLK_STOP_DISABLE()         CLEAR_BIT(RCC->AHB1STPENR1, RCC_AHB1STPENR1_ADF1STPEN)
#define __HAL_RCC_FLASH_CLK_STOP_DISABLE()        CLEAR_BIT(RCC->AHB1STPENR1, RCC_AHB1STPENR1_FLASHSTPEN)
#define __HAL_RCC_RAMCFG_CLK_STOP_DISABLE()       CLEAR_BIT(RCC->AHB1STPENR1, RCC_AHB1STPENR1_RAMCFGSTPEN)
#define __HAL_RCC_GTZC1_CLK_STOP_DISABLE()        CLEAR_BIT(RCC->AHB1STPENR1, RCC_AHB1STPENR1_GTZC1STPEN)
#if defined(SRAM4)
#define __HAL_RCC_SRAM4_CLK_STOP_DISABLE()        CLEAR_BIT(RCC->AHB1STPENR1, RCC_AHB1STPENR1_SRAM4STPEN)
#endif /* SRAM4 */
#define __HAL_RCC_SRAM1_CLK_STOP_DISABLE()        CLEAR_BIT(RCC->AHB1STPENR1, RCC_AHB1STPENR1_SRAM1STPEN)
/**
  * @}
  */

/** @defgroup RCC_AHB2_Peripheral_Clock_Stop_Enable_Disable AHB2 Peripheral Clock Stop Enable Disable
  * @brief  Enable or disable the AHB2 peripheral clock during Stop mode.
  * @note   Peripheral clock gating in STOP mode can be used to further reduce
  *         power consumption.
  * @note   By default, all peripheral clocks are enabled during STOP mode.
  * @{
  */
#define __HAL_RCC_GPIOA_CLK_STOP_ENABLE()         SET_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIOASTPEN)
#define __HAL_RCC_GPIOB_CLK_STOP_ENABLE()         SET_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIOBSTPEN)
#define __HAL_RCC_GPIOC_CLK_STOP_ENABLE()         SET_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIOCSTPEN)
#define __HAL_RCC_GPIOD_CLK_STOP_ENABLE()         SET_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIODSTPEN)
#define __HAL_RCC_GPIOE_CLK_STOP_ENABLE()         SET_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIOESTPEN)
#if defined(GPIOF)
#define __HAL_RCC_GPIOF_CLK_STOP_ENABLE()         SET_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIOFSTPEN)
#endif /* GPIOF */
#define __HAL_RCC_GPIOG_CLK_STOP_ENABLE()         SET_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIOGSTPEN)
#define __HAL_RCC_GPIOH_CLK_STOP_ENABLE()         SET_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIOHSTPEN)
#define __HAL_RCC_DAC1_CLK_STOP_ENABLE()          SET_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_DAC1STPEN)
#define __HAL_RCC_SRAM2_CLK_STOP_ENABLE()         SET_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_SRAM2STPEN)
#if defined(SRAM3)
#define __HAL_RCC_SRAM3_CLK_STOP_ENABLE()         SET_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_SRAM3STPEN)
#endif /* SRAM3 */

#define __HAL_RCC_GPIOA_CLK_STOP_DISABLE()        CLEAR_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIOASTPEN)
#define __HAL_RCC_GPIOB_CLK_STOP_DISABLE()        CLEAR_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIOBSTPEN)
#define __HAL_RCC_GPIOC_CLK_STOP_DISABLE()        CLEAR_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIOCSTPEN)
#define __HAL_RCC_GPIOD_CLK_STOP_DISABLE()        CLEAR_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIODSTPEN)
#define __HAL_RCC_GPIOE_CLK_STOP_DISABLE()        CLEAR_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIOESTPEN)
#if defined(GPIOF)
#define __HAL_RCC_GPIOF_CLK_STOP_DISABLE()        CLEAR_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIOFSTPEN)
#endif /* GPIOF */
#define __HAL_RCC_GPIOG_CLK_STOP_DISABLE()        CLEAR_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIOGSTPEN)
#define __HAL_RCC_GPIOH_CLK_STOP_DISABLE()        CLEAR_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIOHSTPEN)
#define __HAL_RCC_DAC1_CLK_STOP_DISABLE()         CLEAR_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_DAC1STPEN)
#define __HAL_RCC_SRAM2_CLK_STOP_DISABLE()        CLEAR_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_SRAM2STPEN)
#if defined(SRAM3)
#define __HAL_RCC_SRAM3_CLK_STOP_DISABLE()        CLEAR_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_SRAM3STPEN)
#endif /* SRAM3 */
/**
  * @}
  */
/** @defgroup RCC_APB1_Peripheral_Clock_Stop_Enable_Disable APB1 Peripheral Clock Stop Enable Disable
  * @brief  Enable or disable the APB1 peripheral clock during Stop mode.
  * @note   Peripheral clock gating in STOP mode can be used to further reduce
  *         power consumption.
  * @note   By default, all peripheral clocks are enabled during STOP mode.
  * @{
  */
#define __HAL_RCC_SPI3_CLK_STOP_ENABLE()          SET_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_SPI3STPEN)
#if defined(SPI4)
#define __HAL_RCC_SPI4_CLK_STOP_ENABLE()          SET_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_SPI4STPEN)
#endif /* SPI4 */
#define __HAL_RCC_SPI2_CLK_STOP_ENABLE()          SET_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_SPI2STPEN)
#if defined(USART2)
#define __HAL_RCC_USART2_CLK_STOP_ENABLE()        SET_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_USART2STPEN)
#endif /* USART2 */
#define __HAL_RCC_USART3_CLK_STOP_ENABLE()        SET_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_USART3STPEN)
#define __HAL_RCC_UART4_CLK_STOP_ENABLE()         SET_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_UART4STPEN)
#define __HAL_RCC_UART5_CLK_STOP_ENABLE()         SET_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_UART5STPEN)
#define __HAL_RCC_I2C1_CLK_STOP_ENABLE()          SET_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_I2C1STPEN)
#define __HAL_RCC_I2C2_CLK_STOP_ENABLE()          SET_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_I2C2STPEN)
#define __HAL_RCC_I3C1_CLK_STOP_ENABLE()          SET_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_I3C1STPEN)
#define __HAL_RCC_OPAMP_CLK_STOP_ENABLE()         SET_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_OPAMPSTPEN)
#define __HAL_RCC_VREF_CLK_STOP_ENABLE()          SET_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_VREFSTPEN)
#define __HAL_RCC_RTCAPB_CLK_STOP_ENABLE()        SET_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_RTCAPBSTPEN)
#if defined(I2C4)
#define __HAL_RCC_I2C4_CLK_STOP_ENABLE()          SET_BIT(RCC->APB1STPENR2, RCC_APB1STPENR2_I2C4STPEN)
#endif /* I2C4 */
#define __HAL_RCC_LPTIM2_CLK_STOP_ENABLE()        SET_BIT(RCC->APB1STPENR2, RCC_APB1STPENR2_LPTIM2STPEN)

#define __HAL_RCC_SPI3_CLK_STOP_DISABLE()         CLEAR_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_SPI3STPEN)
#if defined(SPI4)
#define __HAL_RCC_SPI4_CLK_STOP_DISABLE()         CLEAR_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_SPI4STPEN)
#endif /* SPI4 */
#define __HAL_RCC_SPI2_CLK_STOP_DISABLE()         CLEAR_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_SPI2STPEN)
#if defined(USART2)
#define __HAL_RCC_USART2_CLK_STOP_DISABLE()       CLEAR_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_USART2STPEN)
#endif /* USART2 */
#define __HAL_RCC_USART3_CLK_STOP_DISABLE()       CLEAR_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_USART3STPEN)
#define __HAL_RCC_UART4_CLK_STOP_DISABLE()        CLEAR_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_UART4STPEN)
#define __HAL_RCC_UART5_CLK_STOP_DISABLE()        CLEAR_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_UART5STPEN)
#define __HAL_RCC_I2C1_CLK_STOP_DISABLE()         CLEAR_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_I2C1STPEN)
#define __HAL_RCC_I2C2_CLK_STOP_DISABLE()         CLEAR_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_I2C2STPEN)
#define __HAL_RCC_I3C1_CLK_STOP_DISABLE()         CLEAR_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_I3C1STPEN)
#define __HAL_RCC_OPAMP_CLK_STOP_DISABLE()        CLEAR_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_OPAMPSTPEN)
#define __HAL_RCC_VREF_CLK_STOP_DISABLE()         CLEAR_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_VREFSTPEN)
#define __HAL_RCC_RTCAPB_CLK_STOP_DISABLE()       CLEAR_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_RTCAPBSTPEN)
#if defined(I2C4)
#define __HAL_RCC_I2C4_CLK_STOP_DISABLE()         CLEAR_BIT(RCC->APB1STPENR2, RCC_APB1STPENR2_I2C4STPEN)
#endif /* I2C4 */
#define __HAL_RCC_LPTIM2_CLK_STOP_DISABLE()       CLEAR_BIT(RCC->APB1STPENR2, RCC_APB1STPENR2_LPTIM2STPEN)
/**
  * @}
  */

/** @defgroup RCC_APB2_Peripheral_Clock_Stop_Enable_Disable APB2 Peripheral Clock Stop Enable Disable
  * @brief  Enable or disable the APB2 peripheral clock during Stop mode.
  * @note   Peripheral clock gating in STOP mode can be used to further reduce
  *         power consumption.
  * @note   By default, all peripheral clocks are enabled during STOP mode.
  * @{
  */
#define __HAL_RCC_SPI1_CLK_STOP_ENABLE()          SET_BIT(RCC->APB2STPENR, RCC_APB2STPENR_SPI1STPEN)
#define __HAL_RCC_USART1_CLK_STOP_ENABLE()        SET_BIT(RCC->APB2STPENR, RCC_APB2STPENR_USART1STPEN)
#define __HAL_RCC_USB1_CLK_STOP_ENABLE()          SET_BIT(RCC->APB2STPENR, RCC_APB2STPENR_USB1STPEN)
#define __HAL_RCC_I3C2_CLK_STOP_ENABLE()          SET_BIT(RCC->APB2STPENR, RCC_APB2STPENR_I3C2STPEN)

#define __HAL_RCC_SPI1_CLK_STOP_DISABLE()         CLEAR_BIT(RCC->APB2STPENR, RCC_APB2STPENR_SPI1STPEN)
#define __HAL_RCC_USART1_CLK_STOP_DISABLE()       CLEAR_BIT(RCC->APB2STPENR, RCC_APB2STPENR_USART1STPEN)
#define __HAL_RCC_USB1_CLK_STOP_DISABLE()         CLEAR_BIT(RCC->APB2STPENR, RCC_APB2STPENR_USB1STPEN)
#define __HAL_RCC_I3C2_CLK_STOP_DISABLE()         CLEAR_BIT(RCC->APB2STPENR, RCC_APB2STPENR_I3C2STPEN)
/**
  * @}
  */

/** @defgroup RCC_APB3_Peripheral_Clock_Stop_Enable_Disable APB3 Peripheral Clock Stop Enable Disable
  * @brief  Enable or disable the APB3 peripheral clock during Stop mode.
  * @note   Peripheral clock gating in STOP mode can be used to further reduce
  *         power consumption.
  * @note   By default, all peripheral clocks are enabled during STOP mode.
  * @{
  */
#define __HAL_RCC_LPUART1_CLK_STOP_ENABLE()       SET_BIT(RCC->APB3STPENR, RCC_APB3STPENR_LPUART1STPEN)
#define __HAL_RCC_I2C3_CLK_STOP_ENABLE()          SET_BIT(RCC->APB3STPENR, RCC_APB3STPENR_I2C3STPEN)
#define __HAL_RCC_LPTIM1_CLK_STOP_ENABLE()        SET_BIT(RCC->APB3STPENR, RCC_APB3STPENR_LPTIM1STPEN)
#define __HAL_RCC_LPTIM3_CLK_STOP_ENABLE()        SET_BIT(RCC->APB3STPENR, RCC_APB3STPENR_LPTIM3STPEN)
#define __HAL_RCC_LPTIM4_CLK_STOP_ENABLE()        SET_BIT(RCC->APB3STPENR, RCC_APB3STPENR_LPTIM4STPEN)
#define __HAL_RCC_COMP_CLK_STOP_ENABLE()          SET_BIT(RCC->APB3STPENR, RCC_APB3STPENR_COMPSTPEN)

