stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc.h
#define __HAL_RCC_LPUART1_CLK_STOP_DISABLE()      CLEAR_BIT(RCC->APB3STPENR, RCC_APB3STPENR_LPUART1STPEN)
#define __HAL_RCC_I2C3_CLK_STOP_DISABLE()         CLEAR_BIT(RCC->APB3STPENR, RCC_APB3STPENR_I2C3STPEN)
#define __HAL_RCC_LPTIM1_CLK_STOP_DISABLE()       CLEAR_BIT(RCC->APB3STPENR, RCC_APB3STPENR_LPTIM1STPEN)
#define __HAL_RCC_LPTIM3_CLK_STOP_DISABLE()       CLEAR_BIT(RCC->APB3STPENR, RCC_APB3STPENR_LPTIM3STPEN)
#define __HAL_RCC_LPTIM4_CLK_STOP_DISABLE()       CLEAR_BIT(RCC->APB3STPENR, RCC_APB3STPENR_LPTIM4STPEN)
#define __HAL_RCC_COMP_CLK_STOP_DISABLE()         CLEAR_BIT(RCC->APB3STPENR, RCC_APB3STPENR_COMPSTPEN)
/**
  * @}
  */

/** @defgroup RCC_AHB1_Peripheral_Clock_Stop_Enabled_Status AHB1 Peripheral Clock Stop Enabled Status
  * @brief  Check whether the AHB1 peripheral clock during Low Power (Stop) is enabled or not.
  * @{
  */
#define __HAL_RCC_GPDMA1_IS_CLK_STOP_ENABLED()    (READ_BIT(RCC->AHB1STPENR1, RCC_AHB1STPENR1_GPDMA1STPEN) != 0U)
#define __HAL_RCC_ADF1_IS_CLK_STOP_ENABLED()      (READ_BIT(RCC->AHB1STPENR1, RCC_AHB1STPENR1_ADF1STPEN) != 0U)
#define __HAL_RCC_FLASH_IS_CLK_STOP_ENABLED()     (READ_BIT(RCC->AHB1STPENR1, RCC_AHB1STPENR1_FLASHSTPEN) != 0U)
#define __HAL_RCC_RAMCFG_IS_CLK_STOP_ENABLED()    (READ_BIT(RCC->AHB1STPENR1, RCC_AHB1STPENR1_RAMCFGSTPEN) != 0U)
#define __HAL_RCC_GTZC1_IS_CLK_STOP_ENABLED()     (READ_BIT(RCC->AHB1STPENR1, RCC_AHB1STPENR1_GTZC1STPEN) != 0U)
#if defined(SRAM4)
#define __HAL_RCC_SRAM4_IS_CLK_STOP_ENABLED()     (READ_BIT(RCC->AHB1STPENR1, RCC_AHB1STPENR1_SRAM4STPEN) != 0U)
#endif /* SRAM4 */
#define __HAL_RCC_SRAM1_IS_CLK_STOP_ENABLED()     (READ_BIT(RCC->AHB1STPENR1, RCC_AHB1STPENR1_SRAM1STPEN) != 0U)
/**
  * @}
  */

/** @defgroup RCC_AHB2_Peripheral_Clock_Stop_Enabled_Status AHB2 Peripheral Clock Stop Enabled Status
  * @brief  Check whether the AHB2 peripheral clock during Low Power (Stop) is enabled or not.
  * @{
  */
#define __HAL_RCC_GPIOA_IS_CLK_STOP_ENABLED()     (READ_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIOASTPEN) != 0U)
#define __HAL_RCC_GPIOB_IS_CLK_STOP_ENABLED()     (READ_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIOBSTPEN) != 0U)
#define __HAL_RCC_GPIOC_IS_CLK_STOP_ENABLED()     (READ_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIOCSTPEN) != 0U)
#define __HAL_RCC_GPIOD_IS_CLK_STOP_ENABLED()     (READ_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIODSTPEN) != 0U)
#define __HAL_RCC_GPIOE_IS_CLK_STOP_ENABLED()     (READ_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIOESTPEN) != 0U)
#if defined(GPIOF)
#define __HAL_RCC_GPIOF_IS_CLK_STOP_ENABLED()     (READ_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIOFSTPEN) != 0U)
#endif /* GPIOF */
#define __HAL_RCC_GPIOG_IS_CLK_STOP_ENABLED()     (READ_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIOGSTPEN) != 0U)
#define __HAL_RCC_GPIOH_IS_CLK_STOP_ENABLED()     (READ_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_GPIOHSTPEN) != 0U)
#define __HAL_RCC_DAC1_IS_CLK_STOP_ENABLED()      (READ_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_DAC1STPEN) != 0U)
#define __HAL_RCC_SRAM2_IS_CLK_STOP_ENABLED()     (READ_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_SRAM2STPEN) != 0U)
#if defined(SRAM3)
#define __HAL_RCC_SRAM3_IS_CLK_STOP_ENABLED()     (READ_BIT(RCC->AHB2STPENR1, RCC_AHB2STPENR1_SRAM3STPEN) != 0U)
#endif /* SRAM3 */
/**
  * @}
  */

/** @defgroup RCC_APB1_Peripheral_Clock_Stop_Enabled_Status APB1 Peripheral Clock Stop Enabled Status
  * @brief  Check whether the APB1 peripheral clock during Low Power (Stop) is enabled or not.
  * @{
  */
#define __HAL_RCC_SPI3_IS_CLK_STOP_ENABLED()      (READ_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_SPI3STPEN) != 0U)
#if defined(SPI4)
#define __HAL_RCC_SPI4_IS_CLK_STOP_ENABLED()      (READ_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_SPI4STPEN) != 0U)
#endif /* SPI4 */
#define __HAL_RCC_SPI2_IS_CLK_STOP_ENABLED()      (READ_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_SPI2STPEN) != 0U)
#if defined(USART2)
#define __HAL_RCC_USART2_IS_CLK_STOP_ENABLED()    (READ_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_USART2STPEN) != 0U)
#endif /* USART2 */
#define __HAL_RCC_USART3_IS_CLK_STOP_ENABLED()    (READ_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_USART3STPEN) != 0U)
#define __HAL_RCC_UART4_IS_CLK_STOP_ENABLED()     (READ_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_UART4STPEN) != 0U)
#define __HAL_RCC_UART5_IS_CLK_STOP_ENABLED()     (READ_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_UART5STPEN) != 0U)
#define __HAL_RCC_I2C1_IS_CLK_STOP_ENABLED()      (READ_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_I2C1STPEN) != 0U)
#define __HAL_RCC_I2C2_IS_CLK_STOP_ENABLED()      (READ_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_I2C2STPEN) != 0U)
#define __HAL_RCC_I3C1_IS_CLK_STOP_ENABLED()      (READ_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_I3C1STPEN) != 0U)
#define __HAL_RCC_OPAMP_IS_CLK_STOP_ENABLED()     (READ_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_OPAMPSTPEN) != 0U)
#define __HAL_RCC_VREF_IS_CLK_STOP_ENABLED()      (READ_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_VREFSTPEN) != 0U)
#define __HAL_RCC_RTCAPB_IS_CLK_STOP_ENABLED()    (READ_BIT(RCC->APB1STPENR1, RCC_APB1STPENR1_RTCAPBSTPEN) != 0U)
#if defined(I2C4)
#define __HAL_RCC_I2C4_IS_CLK_STOP_ENABLED()      (READ_BIT(RCC->APB1STPENR2, RCC_APB1STPENR2_I2C4STPEN) != 0U)
#endif /* I2C4 */
#define __HAL_RCC_LPTIM2_IS_CLK_STOP_ENABLED()    (READ_BIT(RCC->APB1STPENR2, RCC_APB1STPENR2_LPTIM2STPEN) != 0U)
/**
  * @}
  */

/** @defgroup RCC_APB2_Peripheral_Clock_Stop_Enabled_Status APB2 Peripheral Clock Stop Enabled Status
  * @brief  Check whether the APB2 peripheral clock during Low Power (Stop) mode is enabled or not.
  * @{
  */
#define __HAL_RCC_SPI1_IS_CLK_STOP_ENABLED()      (READ_BIT(RCC->APB2STPENR, RCC_APB2STPENR_SPI1STPEN) != 0U)
#define __HAL_RCC_USART1_IS_CLK_STOP_ENABLED()    (READ_BIT(RCC->APB2STPENR, RCC_APB2STPENR_USART1STPEN) != 0U)
#define __HAL_RCC_USB1_IS_CLK_STOP_ENABLED()      (READ_BIT(RCC->APB2STPENR, RCC_APB2STPENR_USB1STPEN) != 0U)
#define __HAL_RCC_I3C2_IS_CLK_STOP_ENABLED()      (READ_BIT(RCC->APB2STPENR, RCC_APB2STPENR_I3C2STPEN) != 0U)
/**
  * @}
  */

/** @defgroup RCC_APB3_Peripheral_Clock_Stop_Enabled_Status APB3 Peripheral Clock Stop Enabled Status
  * @brief  Check whether the APB3 peripheral clock during Low Power (Stop) mode is enabled or not.
  * @{
  */
#define __HAL_RCC_LPUART1_IS_CLK_STOP_ENABLED()   (READ_BIT(RCC->APB3STPENR, RCC_APB3STPENR_LPUART1STPEN) != 0U)
#define __HAL_RCC_I2C3_IS_CLK_STOP_ENABLED()      (READ_BIT(RCC->APB3STPENR, RCC_APB3STPENR_I2C3STPEN) != 0U)
#define __HAL_RCC_LPTIM1_IS_CLK_STOP_ENABLED()    (READ_BIT(RCC->APB3STPENR, RCC_APB3STPENR_LPTIM1STPEN) != 0U)
#define __HAL_RCC_LPTIM3_IS_CLK_STOP_ENABLED()    (READ_BIT(RCC->APB3STPENR, RCC_APB3STPENR_LPTIM3STPEN) != 0U)
#define __HAL_RCC_LPTIM4_IS_CLK_STOP_ENABLED()    (READ_BIT(RCC->APB3STPENR, RCC_APB3STPENR_LPTIM4STPEN) != 0U)
#define __HAL_RCC_COMP_IS_CLK_STOP_ENABLED()      (READ_BIT(RCC->APB3STPENR, RCC_APB3STPENR_COMPSTPEN) != 0U)
/**
  * @}
  */

/** @defgroup RCC_Backup_Domain_Reset RCC Backup Domain Reset
  * @{
  */
/** @brief  Macros to force or release the Backup domain reset.
  * @note   This function resets the RTC peripheral (including the backup registers)
  *         and the RTC clock source selection in RCC_CSR register.
  * @retval None
  */
#define __HAL_RCC_BACKUPRESET_FORCE()             SET_BIT(RCC->BDCR, RCC_BDCR_BDRST)
#define __HAL_RCC_BACKUPRESET_RELEASE()           CLEAR_BIT(RCC->BDCR, RCC_BDCR_BDRST)
/**
  * @}
  */

/** @defgroup RCC_Oscillators_Clocks_Configuration Oscillators and Clocks Configuration
  * @{
  */
/** @brief  Macros to enable or disable the Internal High Speed 16MHz oscillator (HSI).
  * @note   The HSI is stopped by hardware when entering STOP and STANDBY modes.
  *         It is used (enabled by hardware) as system clock source after startup
  *         from Reset, wakeup from STOP and STANDBY mode, or in case of failure
  *         of the HSE used directly or indirectly as system clock (if the Clock
  *         Security System CSS is enabled).
  * @note   HSI can not be stopped if it is used as system clock source. In this case,
  *         you have to select another source of the system clock then stop the HSI.
  * @note   After enabling the HSI, the application software should wait on HSIRDY
  *         flag to be set indicating that HSI clock is stable and can be used as
  *         system clock source.
  *         This parameter can be: ENABLE or DISABLE.
  * @note   When the HSI is stopped, HSIRDY flag goes low after 6 HSI oscillator
  *         clock cycles.
  * @retval None
  */
#define __HAL_RCC_HSI_ENABLE()                    SET_BIT(RCC->CR, RCC_CR_HSION)
#define __HAL_RCC_HSI_DISABLE()                   CLEAR_BIT(RCC->CR, RCC_CR_HSION)

/** @brief  Macro to adjust the Internal High Speed 16MHz oscillator (HSI) calibration value.
  * @note   The calibration is used to compensate for the variations in voltage
  *         and temperature that influence the frequency of the internal HSI RC.
  * @param  __HSICALIBRATIONVALUE__: specifies the calibration trimming value
  *         (default is RCC_HSICALIBRATION_DEFAULT).
  *         This parameter must be a number between 0 and 0x1F.
  * @retval None
  */
#define __HAL_RCC_HSI_CALIBRATIONVALUE_ADJUST(__HSICALIBRATIONVALUE__) \
  MODIFY_REG(RCC->ICSCR3, RCC_ICSCR3_HSITRIM, (__HSICALIBRATIONVALUE__) << RCC_ICSCR3_HSITRIM_Pos)

/**
  * @brief    Macros to enable or disable the force of the Internal High Speed oscillator (HSI)
  *           in STOP mode to be quickly available as kernel clock for USARTs, LPUART and I2Cs.
  * @note     Keeping the HSI ON in STOP mode allows to avoid slowing down the communication
  *           speed because of the HSI startup time.
  * @note     The enable of this function has not effect on the HSION bit.
  *           This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
#define __HAL_RCC_HSISTOP_ENABLE()                SET_BIT(RCC->CR, RCC_CR_HSIKERON)
#define __HAL_RCC_HSISTOP_DISABLE()               CLEAR_BIT(RCC->CR, RCC_CR_HSIKERON)

/** @brief  Macros to enable or disable the Internal Low Speed oscillator LSI.
  * @note   After enabling the LSI, the application software should wait on
  *         LSIRDY flag to be set indicating that LSI clock is stable and can
  *         be used to clock the IWDG and/or the RTC.
  * @note   When the IWDG is started the LSI clock is forced on and cannot be disabled.
  *         When LSI is disabled LSI will be forced on.
  * @note   When the LSI is stopped, LSIRDY flag goes low after 3 LSI oscillator
  *         clock cycles.
  * @retval None
  */
#define __HAL_RCC_LSI_ENABLE()                    SET_BIT(RCC->CSR, RCC_CSR_LSION)
#define __HAL_RCC_LSI_DISABLE()                   CLEAR_BIT(RCC->CSR, RCC_CSR_LSION)

