stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc.h
/** @brief  Macro to set Low-speed clock LSI divider.
  * @note   Only LSI clock can be divided
  * @note   This bit can be written only when the LSI is disabled (LSION = 0 and LSIRDY = 0).
  *         The LSIPREDIV cannot be changed if the LSI is used by the IWDG or by the RTC.
  * @param  __DIVIDER__ : specifies the divider value
  *          This parameter can be one of the following values
  *          @arg @ref RCC_LSI_DIV1
  *          @arg @ref RCC_LSI_DIV128
  * @retval None
  */
#define __HAL_RCC_LSI_DIV_CONFIG(__DIVIDER__)     MODIFY_REG(RCC->CSR, RCC_CSR_LSIPREDIV, __DIVIDER__)

/**
  * @brief  Macro to configure the External High Speed oscillator (HSE).
  * @note   After enabling the HSE (RCC_HSE_ON), the application
  *         software should wait on HSERDY flag to be set indicating that HSE clock
  *         is stable and can be used to clock the system clock.
  * @note   HSE state can not be changed if it is used directly as system clock.
  *         In this case, you have to select another source, of the system clock
  *          then change the HSE state (ex. disable it).
  * @note   The HSE is stopped by hardware when entering STOP and STANDBY or shutdown modes.
  * @note   HSERDY flag may remain high when HSEON bit is cleared.
  * @param  __STATE__: specifies the new state of the HSE.
  *         This parameter can be a combination of the following values:
  *            @arg @ref RCC_HSE_OFF            Turn OFF the HSE oscillator, HSERDY flag goes low after
  *                                             6 HSE oscillator clock cycles.
  *            @arg @ref RCC_HSE_ON             Turn ON the HSE oscillator.
  *            @arg @ref RCC_HSE_BYPASS         Turn ON HSE in analog bypass mode
  *            @arg @ref RCC_HSE_BYPASS_DIGITAL Turn ON HSE in digital bypass mode
  * @retval None
  */
#define __HAL_RCC_HSE_CONFIG(__STATE__)           do {                                                      \
                                                    if((__STATE__) == RCC_HSE_ON)                           \
                                                    {                                                       \
                                                      SET_BIT(RCC->CR, RCC_CR_HSEON);                       \
                                                    }                                                       \
                                                    else if((__STATE__) == RCC_HSE_BYPASS)                  \
                                                    {                                                       \
                                                      SET_BIT(RCC->CR, RCC_CR_HSEBYP);                      \
                                                      SET_BIT(RCC->CR, RCC_CR_HSEON);                       \
                                                    }                                                       \
                                                    else if((__STATE__) == RCC_HSE_BYPASS_DIGITAL)          \
                                                    {                                                       \
                                                      SET_BIT(RCC->CR, (RCC_CR_HSEBYP | RCC_CR_HSEEXT));    \
                                                      SET_BIT(RCC->CR, RCC_CR_HSEON);                       \
                                                    }                                                       \
                                                    else                                                    \
                                                    {                                                       \
                                                      CLEAR_BIT(RCC->CR, RCC_CR_HSEON);                     \
                                                      CLEAR_BIT(RCC->CR, (RCC_CR_HSEBYP | RCC_CR_HSEEXT));  \
                                                    }                                                       \
                                                  } while(0U)

/** @brief  Macros to enable or disable the Internal High Speed 48MHz oscillator (HSI48).
  * @note   The HSI48 is stopped by hardware when entering STOP mode.
  * @note   After enabling the HSI48, the application software should wait on HSI48RDY
  *         flag to be set indicating that HSI48 clock is stable.
  * @retval None
  */
#define __HAL_RCC_HSI48_ENABLE()                  SET_BIT(RCC->CR, RCC_CR_HSI48ON)
#define __HAL_RCC_HSI48_DISABLE()                 CLEAR_BIT(RCC->CR, RCC_CR_HSI48ON)

/** @brief   Macro to enable or disable the LSE system clock.
  * @note    This clock can be used by any peripheral when its source clock is the LSE or at system
  *          in case of one of the LSCOSEL, MCO or CSS on LSE is needed.
  * @note    The LSESYS clock can be generated even if LSESYSEN= 0 if the LSE clock is requested by
  *          the CSS on LSE, by a peripheral or any other source clock using LSE.
  * @retval None
  */
#define __HAL_RCC_LSESYS_ENABLE()                 SET_BIT(RCC->BDCR,RCC_BDCR_LSESYSEN)
#define __HAL_RCC_LSESYS_DISABLE()                CLEAR_BIT(RCC->BDCR,RCC_BDCR_LSESYSEN)

/** @brief  Macros to enable or disable LSE clock glitch filter .
  * @note   The glitches on LSE can be filtred by setting the LSEGFON.
  * @note   LSEGFON must be written when the LSE is disabled (LSEON = 0 and LSERDY = 0).
  * @retval None
  */
#define __HAL_RCC_LSE_GLITCH_FILTER_ENABLE()       SET_BIT(RCC->BDCR, RCC_BDCR_LSEGFON )
#define __HAL_RCC_LSE_GLITCH_FILTER_DISABLE()      CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSEGFON )

/**
  * @brief  Macro to configure the External Low Speed oscillator (LSE).
  * @note   Transitions LSE Bypass to LSE On and LSE On to LSE Bypass are not
  *         supported by this macro. User should request a transition to LSE Off
  *         first and then LSE On or LSE Bypass.
  * @note   As the LSE is in the Backup domain and write access is denied to
  *         this domain after reset, you have to enable write access using
  *         HAL_PWR_EnableBkUpAccess() function before to configure the LSE
  *         (to be done once after reset).
  * @note   After enabling the LSE, the application
  *         software should wait on LSERDY flag to be set indicating that LSE clock
  *         is stable and can be used to clock the RTC.
  * @param  __STATE__: specifies the new state of the LSE.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_LSE_OFF          Turn OFF the LSE oscillator, LSERDY flag goes low after
  *                                               6 LSE oscillator clock cycles.
  *            @arg @ref RCC_LSE_ON_RTC_ONLY      Turn ON the LSE oscillator to be used only for RTC.
  *            @arg @ref RCC_LSE_ON               Turn ON the LSE oscillator to be used by any peripheral.
  *            @arg @ref RCC_LSE_BYPASS_RTC_ONLY  LSE oscillator bypassed with external clock to be used only for RTC.
  *            @arg @ref RCC_LSE_BYPASS           LSE oscillator bypassed with external clock to be used by any peripheral.
  * @retval None
  */

