stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc.h
/** @brief  Macro to configure the MCO2 clock.
  * @param  __MCOCLKSOURCE__ specifies the MCO2 clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_MCO2SOURCE_NOCLOCK  MCO2 output disabled
  *            @arg @ref RCC_MCO2SOURCE_SYSCLK   System  clock selected as MCO2 source
  *            @arg @ref RCC_MCO2SOURCE_MSIS     MSIS clock selected as MCO2 source
  *            @arg @ref RCC_MCO2SOURCE_HSI      HSI clock selected as MCO2 source
  *            @arg @ref RCC_MCO2SOURCE_HSE      HSE clock selected as MCO2 source
  *            @arg @ref RCC_MCO2SOURCE_LSI      LSI clock selected as MCO2 source
  *            @arg @ref RCC_MCO2SOURCE_LSE      LSE clock selected as MCO2 source
  *            @arg @ref RCC_MCO2SOURCE_HSI48    HSI48 selected as MCO2 source
  *            @arg @ref RCC_MCO2SOURCE_MSIK     MSIK selected as MCO2 source
  * @param  __MCODIV__ specifies the MCO2 clock prescaler.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_MCO2DIV_1    MCO2 clock source is divided by 1
  *            @arg @ref RCC_MCO2DIV_2    MCO2 clock source is divided by 2
  *            @arg @ref RCC_MCO2DIV_4    MCO2 clock source is divided by 4
  *            @arg @ref RCC_MCO2DIV_8    MCO2 clock source is divided by 8
  *            @arg @ref RCC_MCO2DIV_16   MCO2 clock source is divided by 16
  *            @arg @ref RCC_MCO2DIV_32   MCO2 clock source is divided by 32
  *            @arg @ref RCC_MCO2DIV_64   MCO2 clock source is divided by 64
  *            @arg @ref RCC_MCO2DIV_128  MCO2 clock source is divided by 128
  * @retval None
  */
#define __HAL_RCC_MCO2_CONFIG(__MCOCLKSOURCE__, __MCODIV__) \
                 MODIFY_REG(RCC->CFGR1, (RCC_CFGR1_MCO2SEL | RCC_CFGR1_MCO2PRE), ((__MCOCLKSOURCE__) | (__MCODIV__)))
/**
  * @}
  */

/** @defgroup RCC_Flags_Interrupts_Management Flags Interrupts Management
  * @brief macros to manage the specified RCC Flags and interrupts.
  * @{
  */
/** @brief  Enable RCC interrupt
  * @param  __INTERRUPT__: specifies the RCC interrupt sources to be enabled.
  *         This parameter can be any combination of the following values:
  *            @arg @ref RCC_IT_HSIRDY           HSI ready interrupt
  *            @arg @ref RCC_IT_HSI48RDY         HSI ready interrupt
  *            @arg @ref RCC_IT_HSERDY           HSE Ready interrupt
  *            @arg @ref RCC_IT_LSIRDY           LSI Ready interrupt
  *            @arg @ref RCC_IT_LSERDY           LSE Ready interrupt
  *            @arg @ref RCC_IT_MSISRDY          MSIS Ready interrupt
  *            @arg @ref RCC_IT_MSIKRDY          MSIK Ready interrupt
  *            @arg @ref RCC_IT_MSI_PLL1RDY      MSI RC1 PLL ready interrupt
  *            @arg @ref RCC_IT_MSI_PLL0RDY      MSI RC0 PLL ready iInterrupt
  *            @arg @ref RCC_IT_MSI_PLLUNLCK_LSE MSI PLL-mode with HSE unlock interrupt
  *            @arg @ref RCC_IT_MSI_PLLUNLCK_HSE MSI PLL-mode with HSE unlock interrupt
  *            @arg @ref RCC_IT_CSS              HSE clock security system interrupt
  *            @arg @ref RCC_IT_LSECSS           LSE clock security system interrupt
  * @retval None
  */
#define __HAL_RCC_ENABLE_IT(__INTERRUPT__) SET_BIT(RCC->CIER, (__INTERRUPT__))

/** @brief Disable RCC interrupt
  * @param  __INTERRUPT__: specifies the RCC interrupt sources to be disabled.
  *         This parameter can be any combination of the following values:
  *            @arg @ref RCC_IT_HSIRDY           HSI ready interrupt
  *            @arg @ref RCC_IT_HSI48RDY         HSI ready interrupt
  *            @arg @ref RCC_IT_HSERDY           HSE Ready interrupt
  *            @arg @ref RCC_IT_LSIRDY           LSI Ready interrupt
  *            @arg @ref RCC_IT_LSERDY           LSE Ready interrupt
  *            @arg @ref RCC_IT_MSISRDY          MSIS Ready interrupt
  *            @arg @ref RCC_IT_MSIKRDY          MSIK Ready interrupt
  *            @arg @ref RCC_IT_MSI_PLL1RDY      MSI RC1 PLL ready interrupt
  *            @arg @ref RCC_IT_MSI_PLL0RDY      MSI RC0 PLL ready iInterrupt
  *            @arg @ref RCC_IT_MSI_PLLUNLCK_LSE MSI PLL-mode with HSE unlock interrupt
  *            @arg @ref RCC_IT_MSI_PLLUNLCK_HSE MSI PLL-mode with HSE unlock interrupt
  *            @arg @ref RCC_IT_CSS              HSE clock security system interrupt
  *            @arg @ref RCC_IT_LSECSS           LSE clock security system interrupt
  * @retval None
  */
#define __HAL_RCC_DISABLE_IT(__INTERRUPT__) CLEAR_BIT(RCC->CIER, (__INTERRUPT__))

/** @brief  Clear the RCC's interrupt pending bits
  * @param  __INTERRUPT__: specifies the interrupt pending bit to clear.
  *         This parameter can be any combination of the following values:
  *            @arg @ref RCC_IT_HSIRDY           HSI ready interrupt
  *            @arg @ref RCC_IT_HSI48RDY         HSI ready interrupt
  *            @arg @ref RCC_IT_HSERDY           HSE Ready interrupt
  *            @arg @ref RCC_IT_LSIRDY           LSI Ready interrupt
  *            @arg @ref RCC_IT_LSERDY           LSE Ready interrupt
  *            @arg @ref RCC_IT_MSISRDY          MSIS Ready interrupt
  *            @arg @ref RCC_IT_MSIKRDY          MSIK Ready interrupt
  *            @arg @ref RCC_IT_MSI_PLL1RDY      MSI RC1 PLL ready interrupt
  *            @arg @ref RCC_IT_MSI_PLL0RDY      MSI RC0 PLL ready iInterrupt
  *            @arg @ref RCC_IT_MSI_PLLUNLCK_LSE MSI PLL-mode with HSE unlock interrupt
  *            @arg @ref RCC_IT_MSI_PLLUNLCK_HSE MSI PLL-mode with HSE unlock interrupt
  *            @arg @ref RCC_IT_LSECSS           LSE clock security system interrupt
  * @retval None
  */
#define __HAL_RCC_CLEAR_IT(__INTERRUPT__) WRITE_REG(RCC->CICR, (__INTERRUPT__))

/** @brief  Check whether the RCC interrupt has occurred or not.
  * @param  __INTERRUPT__: specifies the RCC interrupt source to check.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_IT_HSIRDY           HSI ready interrupt
  *            @arg @ref RCC_IT_HSI48RDY         HSI ready interrupt
  *            @arg @ref RCC_IT_HSERDY           HSE Ready interrupt
  *            @arg @ref RCC_IT_LSIRDY           LSI Ready interrupt
  *            @arg @ref RCC_IT_LSERDY           LSE Ready interrupt
  *            @arg @ref RCC_IT_MSISRDY          MSIS Ready interrupt
  *            @arg @ref RCC_IT_MSIKRDY          MSIK Ready interrupt
  *            @arg @ref RCC_IT_MSI_PLL1RDY      MSI RC1 PLL ready interrupt
  *            @arg @ref RCC_IT_MSI_PLL0RDY      MSI RC0 PLL ready iInterrupt
  *            @arg @ref RCC_IT_MSI_PLLUNLCK_LSE MSI PLL-mode with HSE unlock interrupt
  *            @arg @ref RCC_IT_MSI_PLLUNLCK_HSE MSI PLL-mode with HSE unlock interrupt
  *            @arg @ref RCC_IT_CSS              HSE clock security system interrupt
  *            @arg @ref RCC_IT_LSECSS           LSE clock security system interrupt
  * @retval The new state of __INTERRUPT__ (TRUE or FALSE).
  */
#define __HAL_RCC_GET_IT(__INTERRUPT__)  ((RCC->CIFR & (__INTERRUPT__)) == (__INTERRUPT__))

/** @brief Set RMVF bit to clear the reset flags.
  *        The reset flags are: RCC_FLAG_PWRRST, RCC_FLAG_OBLRST, RCC_FLAG_PINRST, RCC_FLAG_BORRST,
  *        RCC_FLAG_SFTRST, RCC_FLAG_IWDGRST, RCC_FLAG_WWDGRST and RCC_FLAG_LPWRRST.
  * @retval None
 */
#define __HAL_RCC_CLEAR_RESET_FLAGS() (RCC->CSR |= RCC_CSR_RMVF)

/** @brief  Check whether the selected RCC flag is set or not.
  * @param  __FLAG__: specifies the flag to check.
  *         This parameter can be one of the following values:
  *            @arg @ref  RCC_FLAG_HSIRDY                  HSI Ready flag
  *            @arg @ref  RCC_FLAG_HSI48RDY                HSI48 Ready flag
  *            @arg @ref  RCC_FLAG_HSERDY                  HSE Ready flag
  *            @arg @ref  RCC_FLAG_MSISRDY                 MSIS Ready flag
  *            @arg @ref  RCC_FLAG_MSIKRDY                 MSIK Ready flag
  *            @arg @ref  RCC_FLAG_MSI_PLL0RDY             MSI RC0 PLL Ready Interrupt flag
  *            @arg @ref  RCC_FLAG_MSI_PLL1RDY             MSI RC1 PLL Ready Interrupt flag
  *            @arg @ref  RCC_FLAG_LSERDY                  LSE Ready flag
  *            @arg @ref  RCC_FLAG_LSESYSRDY               LSESYS Ready flag
  *            @arg @ref  RCC_FLAG_LSECSSD                 LSE Clock Security System Interrupt flag
  *            @arg @ref  RCC_FLAG_OBLRST                  Option Byte Loader reset flag
  *            @arg @ref  RCC_FLAG_PINRST                  PIN reset flag
  *            @arg @ref  RCC_FLAG_BORRST                  BOR reset flag
  *            @arg @ref  RCC_FLAG_SFTRST                  Software Reset flag
  *            @arg @ref  RCC_FLAG_IWDGRST                 Independent Watchdog reset flag
  *            @arg @ref  RCC_FLAG_WWDGRST                 Window watchdog reset flag
  *            @arg @ref  RCC_FLAG_LPWRRST                 Low-Power reset flag
  *            @arg @ref  RCC_FLAG_LSIRDY                  LSI Ready flag
  * @retval The new state of __FLAG__ (TRUE or FALSE).
  */
#define __HAL_RCC_GET_FLAG(__FLAG__) ((((((((__FLAG__) >> 5U) == 1U) ? RCC->CR :                     \
                                        ((((__FLAG__) >> 5U) == 2U) ? RCC->BDCR :                     \
                                        ((((__FLAG__) >> 5U) == 3U) ? RCC->CSR : RCC->CIFR)))) &  \
                                          (1U << ((__FLAG__) & RCC_FLAG_MASK))) != 0U)               \
                                            ? 1U : 0U)
/**
  * @}
  */

/**
  * @}
  */

/* Private constants ---------------------------------------------------------*/
/** @defgroup RCC_Private_Constants RCC Private Constants
  * @{
  */
/* Defines used for Flags */
#define CR_REG_INDEX                    (1U)
#define BDCR_REG_INDEX                  (2U)
#define CSR_REG_INDEX                   (3U)

#define RCC_FLAG_MASK                   (0x1FU)

/* Define used for IS_RCC_* below */
#define RCC_CLOCKTYPE_ALL               (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | \
                                         RCC_CLOCKTYPE_PCLK2 | RCC_CLOCKTYPE_PCLK3)         /*!< All clocks to configure */
#define RCC_OSCILLATORTYPE_ALL          (RCC_OSCILLATORTYPE_HSE | RCC_OSCILLATORTYPE_HSI | RCC_OSCILLATORTYPE_HSI48 | \
                                         RCC_OSCILLATORTYPE_LSE | RCC_OSCILLATORTYPE_LSI | RCC_OSCILLATORTYPE_MSIS |  \
                                         RCC_OSCILLATORTYPE_MSIK) /*!< All Oscillators to configure */

/**
  * @}
  */

