stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_hal_rcc.h
/* Private macros ------------------------------------------------------------*/
/** @addtogroup RCC_Private_Macros
  * @{
  */
#define IS_RCC_OSCILLATORTYPE(__TYPE__)         (((__TYPE__) == RCC_OSCILLATORTYPE_NONE) || \
                                                 (((__TYPE__) & ~RCC_OSCILLATORTYPE_ALL) == 0x00U))

#define IS_RCC_HSE(__STATE__)                   (((__STATE__) == RCC_HSE_OFF)    || ((__STATE__) == RCC_HSE_ON) || \
                                                 ((__STATE__) == RCC_HSE_BYPASS) || ((__STATE__) == RCC_HSE_BYPASS_DIGITAL))

#define IS_RCC_LSE(__STATE__)                   (((__STATE__) == RCC_LSE_OFF) || ((__STATE__) == RCC_LSE_ON_RTC_ONLY)     || \
                                                 ((__STATE__) == RCC_LSE_ON)  || ((__STATE__) == RCC_LSE_BYPASS_RTC_ONLY) || \
                                                 ((__STATE__) == RCC_LSE_BYPASS))

#define IS_RCC_HSI(__STATE__)                   (((__STATE__) == RCC_HSI_OFF) || ((__STATE__) == RCC_HSI_ON))

#define IS_RCC_HSI_CALIBRATION_VALUE(__VALUE__) ((__VALUE__) <= (uint32_t)( RCC_ICSCR3_HSITRIM  >>  RCC_ICSCR3_HSITRIM_Pos))

#define IS_RCC_HSI48(__STATE__)                 (((__STATE__) == RCC_HSI48_OFF) || ((__STATE__) == RCC_HSI48_ON))

#define IS_RCC_LSI(__STATE__)                   (((__STATE__) == RCC_LSI_OFF) || ((__STATE__) == RCC_LSI_ON))

#define IS_RCC_LSI_DIV(__DIV__)                 (((__DIV__) == RCC_LSI_DIV1) || ((__DIV__) == RCC_LSI_DIV128))

#define IS_RCC_MSI(__STATE__)                   (((__STATE__) == RCC_MSI_OFF) || ((__STATE__) == RCC_MSI_ON))

#define IS_RCC_MSI_SOURCE(__RC__)               (((__RC__) == RCC_MSI_RC0) || ((__RC__) == RCC_MSI_RC1))

#define IS_RCC_MSI_DIV(__DIV__)                 (((__DIV__) == RCC_MSI_DIV1) || ((__DIV__) == RCC_MSI_DIV2) || \
                                                 ((__DIV__) == RCC_MSI_DIV4) || ((__DIV__) == RCC_MSI_DIV8))

#define IS_RCC_CLOCKTYPE(__CLK__)               ((((__CLK__) & RCC_CLOCKTYPE_ALL) != 0x00UL) && (((__CLK__) & ~RCC_CLOCKTYPE_ALL) == 0x00UL))

#define IS_RCC_SYSCLKSOURCE(__SOURCE__)         (((__SOURCE__) == RCC_SYSCLKSOURCE_MSIS) || ((__SOURCE__) == RCC_SYSCLKSOURCE_HSI) || \
                                                 ((__SOURCE__) == RCC_SYSCLKSOURCE_HSE))

#define IS_RCC_HCLK(__HCLK__)                   (((__HCLK__) == RCC_SYSCLK_DIV1)   || ((__HCLK__) == RCC_SYSCLK_DIV2)   || \
                                                 ((__HCLK__) == RCC_SYSCLK_DIV4)   || ((__HCLK__) == RCC_SYSCLK_DIV8)   || \
                                                 ((__HCLK__) == RCC_SYSCLK_DIV16)  || ((__HCLK__) == RCC_SYSCLK_DIV64)  || \
                                                 ((__HCLK__) == RCC_SYSCLK_DIV128) || ((__HCLK__) == RCC_SYSCLK_DIV256) || \
                                                 ((__HCLK__) == RCC_SYSCLK_DIV512))

#define IS_RCC_PCLK(__PCLK__)                   (((__PCLK__) == RCC_HCLK_DIV1) || ((__PCLK__) == RCC_HCLK_DIV2) || \
                                                 ((__PCLK__) == RCC_HCLK_DIV4) || ((__PCLK__) == RCC_HCLK_DIV8) || \
                                                 ((__PCLK__) == RCC_HCLK_DIV16))

#define IS_RCC_RTCCLKSOURCE(__SOURCE__)         (((__SOURCE__) == RCC_RTCCLKSOURCE_DISABLE) || \
                                                 ((__SOURCE__) == RCC_RTCCLKSOURCE_LSE)     || \
                                                 ((__SOURCE__) == RCC_RTCCLKSOURCE_LSI)     || \
                                                 ((__SOURCE__) == RCC_RTCCLKSOURCE_HSE_DIV32))

#define IS_RCC_MCO(__MCOX__)                    (((__MCOX__) == RCC_MCO1_PA8) || ((__MCOX__) == RCC_MCO1_PA9) || \
                                                 ((__MCOX__) == RCC_MCO2_PA8) || ((__MCOX__) == RCC_MCO2_PA10))

#define IS_RCC_MCO1SOURCE(__SOURCE__)           (((__SOURCE__) == RCC_MCO1SOURCE_NOCLOCK)  || \
                                                 ((__SOURCE__) == RCC_MCO1SOURCE_SYSCLK)   || \
                                                 ((__SOURCE__) == RCC_MCO1SOURCE_MSIS)     || \
                                                 ((__SOURCE__) == RCC_MCO1SOURCE_HSI)      || \
                                                 ((__SOURCE__) == RCC_MCO1SOURCE_HSE)      || \
                                                 ((__SOURCE__) == RCC_MCO1SOURCE_LSI)      || \
                                                 ((__SOURCE__) == RCC_MCO1SOURCE_LSE)      || \
                                                 ((__SOURCE__) == RCC_MCO1SOURCE_HSI48)    || \
                                                 ((__SOURCE__) == RCC_MCO1SOURCE_MSIK))

#define IS_RCC_MCODIV(__DIV__)                  (((__DIV__) == RCC_MCODIV_1) || ((__DIV__) == RCC_MCODIV_2) || \
                                                 ((__DIV__) == RCC_MCODIV_4) || ((__DIV__) == RCC_MCODIV_8) || \
                                                 ((__DIV__) == RCC_MCODIV_16) || ((__DIV__) == RCC_MCODIV_32) || \
                                                 ((__DIV__) == RCC_MCODIV_64) || ((__DIV__) == RCC_MCODIV_128))

#define IS_RCC_MCO2SOURCE(__SOURCE__)           (((__SOURCE__) == RCC_MCO2SOURCE_NOCLOCK)  || \
                                                 ((__SOURCE__) == RCC_MCO2SOURCE_SYSCLK)   || \
                                                 ((__SOURCE__) == RCC_MCO2SOURCE_MSIS)     || \
                                                 ((__SOURCE__) == RCC_MCO2SOURCE_HSI)      || \
                                                 ((__SOURCE__) == RCC_MCO2SOURCE_HSE)      || \
                                                 ((__SOURCE__) == RCC_MCO2SOURCE_LSI)      || \
                                                 ((__SOURCE__) == RCC_MCO2SOURCE_LSE)      || \
                                                 ((__SOURCE__) == RCC_MCO2SOURCE_HSI48)    || \
                                                 ((__SOURCE__) == RCC_MCO2SOURCE_MSIK))

#define IS_RCC_MCO2DIV(__DIV__)                 (((__DIV__) == RCC_MCO2DIV_1) || ((__DIV__) == RCC_MCO2DIV_2) || \
                                                 ((__DIV__) == RCC_MCO2DIV_4) || ((__DIV__) == RCC_MCO2DIV_8) || \
                                                 ((__DIV__) == RCC_MCO2DIV_16) || ((__DIV__) == RCC_MCO2DIV_32) || \
                                                 ((__DIV__) == RCC_MCO2DIV_64) || ((__DIV__) == RCC_MCO2DIV_128))

